{
    "Are vegans making an impact on climate change?": [
        {
            "author": "Wayne Roberts",
            "author_bio": "writes regularly on food, cities and food policyAuthor has 483 answers and 643.6K answer views5y",
            "text": "I like to think that I have arrived at a balanced perspective on this kind of issue because I have often experimented with a vegan diet and have also had a long experience managing a food policy council —which taught me the importance of seeing food issues from a whole food system perspective.\nVegans can have a positive impact on climate protection. But the precise impact depends on a lot more than vegan choices.\nIf a vegan chooses mainly local and sustainable and minimally processed plant-based foods, that has an enormous impact for good.\nBut if another vegan chooses long distance foods that were sprayed with pesticides, packaged in plastic, and kept in a freezer for a long time, the impact will be negative.\nWalking or driving to the store also makes a difference.\nIn the final analysis, both vegans and non vegans can do a host of things that have a major impact on climate, and the absence or presence of animal products is only one of many possible positive choices.\n441 viewsView upvotesAnswer requested by\nReese Greiner",
            "isRelated": false,
            "isRequested": true,
            "views": "441",
            "upvotes": "5 Upvotes"
        },
        {
            "author": "Kevin Baker",
            "author_bio": "Environment Technical Artist at Crystal Dynamics (company) (2022–present)Author has 8.4K answers and 12.4M answer views10mo",
            "text": "On an individual basis, a vegan diet takes something like half as much carbon emissions as a omnivorous diet. The exact number depends on the details—eggs have a pretty modest carbon footprint, while berries flown across the world have a high one—but it works out to something in that ballpark on average. Food production represents about a quarter of carbon emissions, so a vegan diet leads to a roughly twelve percent reduction in personal carbon emissions.\nThat’s not trivial. But the total number of vegans is not all that high, and as such, the total collective effect isn’t all that big.\n195 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "195",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "CH Crawley",
            "author_bio": "Avionics techAuthor has 4.4K answers and 1.5M answer views1y",
            "text": "No human is making an impact on climate change. That is driven by solar activity cycles. The climate was much warmer in the Medieval Warming Period, and man had nothing to do with it.\n659 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "659",
            "upvotes": "8 Upvotes"
        },
        {
            "author": "Daniel Budd",
            "author_bio": "Author has 5.3K answers and 936.5K answer views4y",
            "text": "Related\nWill being vegan help climate change?\nNope. And so-called climate change is a hoax. It's just government propaganda, and a lie, in order to defraud people out of their hard earned money.\n48 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "48",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Leslie Harvey",
            "author_bio": "Studied at University of California, Los AngelesAuthor has 165 answers and 38K answer views1y",
            "text": "Related\nHow does veganism affect climate change?\nIt has as much affect as stopping a speeding train by standing in front of it and holding up your hand. It is total nonsense.\n106 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "106",
            "upvotes": "6 Upvotes"
        },
        {
            "author": "Albert Pollard",
            "author_bio": "Former Administrative at Federal Government of the United StatesAuthor has 694 answers and 88.1K answer views1y",
            "text": "Related\nDo vegans contribute to global warming?\nDo you breath? Then yes.\n36 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "36",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Avun Jahei",
            "author_bio": "Author has 9.2K answers and 1.6M answer views4y",
            "text": "Related\nWill being vegan help climate change?\nThe carbon footprint of most people largely comes from 3 things:\nHaving a car\nFlying on vacation\nEating meat\nSo yes, it would reduce your carbon footprint substantially.\n117 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "117",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Taggart King",
            "author_bio": "Vegan since 1982, reads widely about nutritionAuthor has 349 answers and 186.6K answer views2y",
            "text": "Related\nDoes going vegan have a big impact on global emissions?\nTake a look at this site, which compares the carbon footprint of different diets in the US\nhttp://shrinkthatfootprint.com/food-carbon-footprint-diet\n68 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "68",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Ryszard Rakowski",
            "author_bio": "Running own business (1992–present)Author has 15.1K answers and 1.7M answer views1y",
            "text": "BUT OF COURSE THEY DO!!!\nLet me explain.\nVegans eat exclusively plants. However, human body needs protein. The main source of plant protein are beans and lentils. And everybody knows what happens when you eat a lot of beans. Therefore vegans fart 10 times more than non-vegans emitting a lot of methane, that is a deadly greenhouse gas that causes global warming. Hence my proposal:\n“President\" Biden should issue an emergency executive order requiring all vegans to plug up their assholes with organic champagne corks to reduce their “carbon footprint\" (methane contains carbon) hence stopping emissions of “greenhouse gas”. Such “action on climate would stop the dreaded global warming and vegans would “save the planet\" from “climate emergency\". I am sure all vegans would be extatic knowing, that champagne corks in their asses stopped global warming in its tracks.😉🤣\n142 viewsView upvotesView 4 shares",
            "isRelated": false,
            "isRequested": false,
            "views": "142",
            "upvotes": "4 Upvotes"
        },
        {
            "author": "L.A.M.",
            "author_bio": "I've been an amateur climatologist since 2017.Author has 2.9K answers and 1.6M answer views1y",
            "text": "Related\nAre vegans a threat to climate change?\nNo, they’re not a threat.\nIt takes diligence to be vegan, and some people have different nutritional needs and/or budgets that may make it impossible. However, being vegan is still helpful when those that can do it. Even just increasing your consumption of plant-based food without entirely cutting out meat and dairy can help. The vast majority of calories grown in plants are lost when they’re fed to livestock; eating them directly is far more efficient. Additionally, cows burp a lot of methane, which is a far more potent greenhouse gas than carbon dioxide; ruminants have very different digestive systems than most other mammals.\nEating less beef reduces emissions directly. Additionally, less land being used for crops to feed livestock or for livestock to graze reduces emissions indirectly by allowing more rainforests and grasslands to exist, as it’s far more efficient calorie-wise for humans to simply consume their crops directly.\n112 viewsView upvotesView 2 shares",
            "isRelated": false,
            "isRequested": false,
            "views": "112",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Phil Dawkins",
            "author_bio": "Supervisor (1988–present)Author has 805 answers and 118.6K answer views4y",
            "text": "Related\nWill going vegan help slow down global warming? How?\nNope. There is NOTHING you or all humans collectively can do to have any real effect on global warming, as we had or likely ever will have ANYTHING to do with global warming. At best we could slow it down by a few percentage points, but slow is all we could do. The earth lives and breathes on a scale nearly incomprehensible to mankind. We CANNOT destroy the earth. We may be able to destroy ourselves though. Quite likely the earth will be around billions of years after we're gone.\n65 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "65",
            "upvotes": "3 Upvotes"
        },
        {
            "author": "George Linker",
            "author_bio": "Author has 17.3K answers and 1.2M answer views1y",
            "text": "Vegans are using climate change to promote their own ideologies.\n91 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "91",
            "upvotes": "4 Upvotes"
        },
        {
            "author": "AngryApe - DEACTIVATED",
            "author_bio": "Field Hand at Johnson's Berry Patch, Oulu, WI; newcoming PhD, Iowa StateAuthor has 3.7K answers and 4.3M answer views4y",
            "text": "Related\nWill going vegan help slow down global warming? How?\nBy cutting out animals as a caloric middleman.\nMost animal products are produced using food that would be completely, 100% edible for humans. Farmed fish are often fed soybeans. Cows are fed corn. Both of those are usually farmed using more fossil fuels as input than the plants absorb from the atmosphere (farming, right now, is a net-carbon-producing endeavor, despite all of the photosynthesis of the plants farmed).\nModern, concentrated meat production increases the amount of high-value land needed for farming intensive dietary staples. So if you cut out the meat, and just eat the plants directly, you’re freeing up money to buy better, healthier foods (such as fruits and vegetables) and, simultaneously, freeing up farmland to provide those crops. The farmland that would otherwise be used for cattle feed can instead produce nuts and berries and other delicious, healthy foods. And foods like that, foods with embodied carbon in the field, in the form of tree trunks and shrub stems, are less carbon-intensive.\nSo going vegan cuts carbon production twofold: it decreases the amount of fossil fuels needed to produce the food you eat, and it simultaneously encourages the conversion of farmlands towards foods that are higher-value and less carbon-intensive.\nTo be clear, I am not vegan, and never will be. I like fish too much, and certainly, fish that you catch yourself from a well-managed lake is completely, 100% sustainable. All these benefits are also available to those who still eat red meat too, but only for the people who know exactly how much fossil fuels it took to raise their meat. It is generally sound moral policy to know the consequences of your actions, and it is very easy for vegans to know that they are not eating any unsustainable meat.\n327 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "327",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Rob Jackson",
            "author_bio": "Journalist at Freelancing (1997–present)Author has 1.2K answers and 128.3K answer views1y",
            "text": "Related\nDo vegans contribute to global warming?\nOf course they do. And animal deaths.\nIt's all a lie that veganism is better for the planet.\n122 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "122",
            "upvotes": "5 Upvotes"
        },
        {
            "author": "John Bruyn",
            "author_bio": "Geophysics, geology, seismology, remote sensing, climatologyAuthor has 5.4K answers and 542.3K answer views2y",
            "text": "Related\nDoes going vegan have a big impact on global emissions?\nAnimals we eat the meat from are digesters of vegetation, just doing it a bit quicker than the natural decomposition and actually storing solar energy as meat and fat, which goes back into the environment at a later date. The difference is a time delay that does not affect global emissions which in any event are prevented from having a global significance by winters that are caused by the obliquity of the Earth’s spin axis that affects the illumination of the poles, just as summers do. If they do so over 41,000 years they may be taken to control the global mean temperatures over shorter periods of time too.\nThat’s where the the variations in the global mean temperatures are coming from - small perturbations in the Earth’s orbits caused mostly by the orbits Jupiter and Saturn with cycles taking less than a century and Uranus and Neptune causing cycles of less than 2 centuries and vary the obliquity of the Earth’s spin axis slightly, called wobbles.\nRising CO2 at Mauna Loa comes from the declining eccentricity of the Earth’s obits increasing the speed of the Earth’s rotation that is making the Earth so very different from Venus where the length of 1 day is 243 Earth days with a thick massive atmosphere that is making its surface very hot and a dead planet.\nIt is the supersonic equatorial speed of the Earth’s rotation (1,677 km/h, 1,042 mph) that controls the atmospheric CO2 content by spinning some of it out to the thermosphere where the sun turns it into plasma. From there the ionised carbon atoms rain down and form polycyclic hydrocarbons and amino acids, which is what started life on Earth in the early atmosphere as prokaryotes. The the ionised oxygen rains back and forms ozone in the stratosphere.\n73 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "73",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "CW204",
            "author_bio": "Director of Finance & Operations (2019–present)Author has 9K answers and 2.1M answer views1y",
            "text": "Related\nAre vegans a threat to climate change?\nOn the contrary, they have a much lower carbon footprint than meat eaters. The agricultural production of meat is a huge source of carbon emissions.\n74 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "74",
            "upvotes": "3 Upvotes"
        },
        {
            "author": "David Sandbrook",
            "author_bio": "Lives in Northeast California (1979–present)Author has 19.2K answers and 12.1M answer views4y",
            "text": "Related\nWill being vegan help climate change?\nNot significantly.\nThe difference in AGW factors between livestock production and plant production, combined with the percentage of meat in the average diet, is small enough being vegan will not have a major global impact.\nIf everyone on the planet became vegan (an impossibility) there would still be some livestock production. Many phar...\nAccess this answer and support the author as a Quora+ subscriber\nAccess all answers reserved by\nDavid Sandbrook\nfor Quora+ subscribers\nAccess exclusive answers from thousands more participating creators in Quora+\nBrowse ad‑free and support creators\nStart free trial\nLearn more\n226 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "226",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Ian McDonald",
            "author_bio": "Author has 86 answers and 5.2K answer views4y",
            "text": "Related\nWill going vegan help slow down global warming? How?\nNo. And if you are not able to ensure you get all the proper vitamins, minerals and proteins your body needs… don't expect to stay healthy for long.\nAlso expect to pay more for pretty much everything if you intend to do it right.\nSure you can do it… but you give up far more than you gain.\n48 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "48",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Stebal",
            "author_bio": "Former Steelworker, lineman; target of racistsAuthor has 1.7K answers and 478.5K answer viewsMay 20",
            "text": "Climate Change really doesn't give a shit.\n42 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "42",
            "upvotes": "1 Upvote"
        }
    ],
    "Can vegetarianism help to stop the global warming?": [
        {
            "author": "Andrew McLeish",
            "author_bio": "BSc (hons) in Environmental Science, The Open University (Graduated 2015)Author has 6.4K answers and 4.3M answer viewsUpdated 3y",
            "text": "Related\nAre people becoming vegetarians to help out global warming, or is it a personal decision?\nI am reducing my meat intake for a number of reasons. These are in no particular order:\nHealth - I have been told by doctors to reduce processed and fried meat intake to reduce a specific type of cholesterol. So basically fresh meat only - no bacon or sausages, or fried steaks - some of the best bits.\nCost - lean meat cuts are geting more expensive\nMy memory - I have a busy life and quite often forget to cook the meat until it is too late, so I end up throwing it out. Very wasteful.\nMy squeamishness - I don't like eating meat on the bone and can only deal with nicer cuts. Again this is wasteful.\nEnvironment - while my job is by many orders of magnitude worse for the environment than my lifestyle (I facilitate commercial air traffic), I want to do my bit\nI like the taste of meat but I don't miss it if I don't have it. So long as I keep up my protein intake, I can take it or leave it. So increasingly I am leaving it.\n61 viewsView upvotes\n1 of 9 answers\n2",
            "isRelated": false,
            "isRequested": false,
            "views": "61",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Kendrick Jackson",
            "author_bio": "Thinking Globally and Acting LocallyAuthor has 73 answers and 189.8K answer views12y",
            "text": "Related\nWhat is the environmental impact of being a vegetarian?\nThe largest impact has to be water. More than half of the water we use goes towards livestock.\nGallons of water needed to produce a pound of wheat: 25\nGallons of water needed to produce a pound of California beef: 5,000\nThe amount of water used through the lifetime of one full grown cow can float a destroyer.\nBeing vegetarian will help the earths water supply tremendously.\n304 viewsView upvotes\n1 of 40 answers\n8",
            "isRelated": false,
            "isRequested": false,
            "views": "304",
            "upvotes": ""
        }
    ],
    "What happens when 8 billion people become vegan overnight, out of desperate necessity…to save their lives from climate change?": [],
    "Why is the majority of people still not vegan despite rapid climate change and environmental destruction?": [],
    "Is it true that eating meat is causing climate change, or is this a fabrication made up by strict vegans?": [],
    "Would you keep meat in your diet or bet on climate change and become vegan?": [],
    "Would you support a law of mandatory vegan diet and the banning of meat in order to defeat climate change?": [],
    "Why do you think choosing vegan meat could help fight climate change?": [
        {
            "author": "Hematita",
            "author_bio": "Visual Enthusiast (2013–present)Author has 4.4K answers and 26.5M answer views3y",
            "text": "Originally Answered: Could choosing vegan meat help fight climate change?\nHonestly, I’m not sure. It depends on several factors.\nWhat is the meat made from?\nIs the cost/flavor/texture something that makes it a sensibly viable alternative to meat?\nIf yes to all of the above, then yes, possibly, but I’m not sure how quick it would be.\nIf we can ever become less dependent on livestock, then we have less cows, pigs, chicken being produced. Less of them is less waste to deal with, and I can’t remember how, but the footprint of cows is pretty big if I remember correctly. It would take time, though, because people love their meat and hate change.\nThe best thing to move it along wo...\nAccess this answer and support the author as a Quora+ subscriber\nAccess all answers reserved by\nHematita\nfor Quora+ subscribers\nAccess exclusive answers from thousands more participating creators in Quora+\nBrowse ad‑free and support creators\nStart free trial\nLearn more\n58 viewsView upvotes\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "58",
            "upvotes": "1 Upvote"
        }
    ],
    "Could we end climate change if everyone in the world went vegan in 2020?": [],
    "If everyone were vegan what impact would that have on climate change?": [
        {
            "author": "Jayne Kulikauskas",
            "author_bio": "eats meat drinks waterAuthor has 496 answers and 347.8K answer views4y",
            "text": "Related\nCan becoming a vegan save the planet from permanent damage done from climate change?\nNo. The opposite is true. There is a kind of agriculture called regenerative agriculture that can reverse damage to the environment. It involves raising livestock and people eating meat.\nCurrent conventional agriculture uses artificial fertilizer which is made from non-renewable resources and creates a huge amount of emissions. It destroys soil, air, and water. Regenerative agriculture, on the other hand, functions more like an natural ecosystem. Ruminants graze on grassland and their manure acts as a natural fertilizer which builds up soil quality and sequesters carbon. Grassland is healthier when animals are properly grazed on it which in turn improves air and water. People then eat the ruminants or use them as a source of milk.\nWe certainly do need to stop producing both animal and plant based food the way that we currently do. It is destructive and inefficient. But all the vegan factoids about how bad it is to eat meat are based on assuming that food will continue to be produced this way. Merely refraining from eating animal products while continuing to raise plants with conventional agriculture is not going to fix problems with the environment. All agriculture, both plant and animal, needs reform. And if we do this, then eating meat will not be harmful to the environment, but rather beneficial.\n592 viewsView upvotes\n1 of 2 answers\n10\n2",
            "isRelated": false,
            "isRequested": false,
            "views": "592",
            "upvotes": "10 Upvotes"
        }
    ],
    "Why do people tend to dislike the idea of a vegan future as we will have to some point to prevent climate change?": [
        {
            "author": "Rosalind Dalefield",
            "author_bio": "Double Board-certified toxicologistAuthor has 12.6K answers and 20M answer views2y",
            "text": "There is no evidence that the human race will have to go vegan to head off climate change. Eat less meat, very possibly. Use primarily lab-grown meat and dairy, very possibly. But completely abandon eating meat, fish, and dairy? No.\n47 viewsView upvotes\n3",
            "isRelated": false,
            "isRequested": false,
            "views": "47",
            "upvotes": "3 Upvotes"
        },
        {
            "author": "Campbell Scott",
            "author_bio": "Retired after 45 years in science education and research.Author has 422 answers and 54.9K answer views2y",
            "text": "Humans evolved to be hunter-gatherers, omnivores. While some cultures came to celebrate meat-eating others have festivals around feast with only vegetables. Our diets are deeply ingrained into our various ways of life - these habits and traditions are hard to change.\nWhat we should hope for is that meat lovers cut down their consumption and that both they vegans accept synthetic proteins whether they tastes like beef or soy.\nWe should also remember that prior to the explosion of human population, huge herds of aurochs and buffalo grazed on temperate grasslands.\n18 viewsView upvotes\n2",
            "isRelated": false,
            "isRequested": false,
            "views": "18",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Why do you not like vegans? — Related",
            "author_bio": "Miles Dolphin",
            "text": "Early morning breakfast cook.Author has 1.3K answers and 3.8M answer viewsUpdated 3y\nI cook breakfasts for people every day - I am permanently prepared for vegetarians, with some special items that are deliberately kept for them. I will arrange for halal and kosher if requested (that's rare though), and non-pork meals are available as standard.\nLast week a vegan arrived (late at night) and demanded a special dish that required ingredients that I did not keep, and was very upset that I could not provide anything more than a continental style breakfast for her.\nI pointed out that she had booked a month previously and had ample opportunity to inform us of her special dietary requ\nContinue Reading\n\n1.7K\n3\n370\nToni Green\n7y\nI once lived with a roommate who was a Militant Vegan. She tried to give the $80+ free-range-organic-gluten free-home grown-lived a happy life-turkey that I prepared for thanksgiving a fucking FUNERAL. AFTER IT WAS COOKED AND PREPARED! Knowing fully that my family and friends were coming any minute and despite the fact that Every. Single. other food item that was being offered for the feast was vegan. I caught her just as she was putting it into a hole in the backyard and SHOVELING DIRT UPON IT…..seriously….. there were candles and flowers…I was LIVID WITH RAGE. She was immediately & severely evicted. I honestly have no idea what kept me from burying her. I am not a rich person by any means so I washed the turkey off, crisped it up again in the oven then poured gravy ( now named spite sauce ) over every damn food in sight so that Nothing was vegan. Oh man it was a glorious feast and we all had a great laugh about it. I put the carcass in the trunk of her car as a parting gift.\n5.5K viewsView upvotes\n1 of 103 answers\n118\n20\nErica Friedman\nRoti or riceAuthor has 11.3K answers and 37.6M answer viewsUpdated 7y\nThis answer is not available due to Quora ignoring my request to not share or reproduce it.\n271\n43",
            "isRelated": false,
            "isRequested": false,
            "views": "5.5K",
            "upvotes": "118 Upvotes"
        },
        {
            "author": "Is veganism a phase for most people? — Related",
            "author_bio": "Marcus Geduld",
            "text": "vegan who avoids anything with added salt, sugar, or oil. Author has 19.8K answers and 88.4M answer views3y\nWe’d need some sort of poll or survey to know for sure, but I suspect it is. There’s no cost to trying-out veganism, so many people do. The majority of them probably don’t keep it up all their lives. There’s lots of pressure to stop: social pressure, pressure from advertisers, and so on.\nTo form a new habit, you generally need to stick with something for at least six months, and—for many people—tho\nContinue Reading\n5\n1\nChristina Wilson\nFormer Computer Operator at Telus (1981–2006)Author has 3.3K answers and 679.5K answer views3y\nIt isn’t for me, I’ve been vegan for 32 years. It takes a bit of work to figure it all out, and maybe some people just aren’t able to. I figured it out, and it’s the best thing I’ve ever done for myself. I’m 66 years old, but people still think I’m 40. My health is excellent, and I am physically active, more than some young people I know of.\n82 viewsView upvotesAnswer requested by\nPavan Fiterson\n1 of 11 answers\n2\n1\nAndi Quercia\nAnimal welfare and liberation advocateAuthor has 1.3K answers and 418K answer views3y\nNot veganism, plant based diet is. A Vegan chose that path for a unselfish reason, usually for the animals, a plant based dietary is doing for trend, or to loose weight or for some temporary health issue.\n2",
            "isRelated": false,
            "isRequested": true,
            "views": "82",
            "upvotes": "2 Upvotes"
        }
    ],
    "As a climate change advocate would you give up eating meat, as it is one of the biggest contributors to the global warming and uses much more resources to produce the same amount of energy as vegetarian/ vegan food does?": [
        {
            "author": "Jack Unsworth",
            "author_bio": "Author has 1.2K answers and 250.2K answer views4y",
            "text": "Originally Answered: As a climate change advocate would you give up eating meat, as it is one of the biggest contributor to the golbal warming and uses much more resources to produce same amount of energy as vegetarian/ vegan food does?\nI’ve drastically reduced the amount of meat I eat, and I’m tempted to reduce it further. I probably eat ten or twenty per cent of the meat that most meat eaters here in the UK eat, and I’m looking at reducing my dairy intake next, although I’m not looking forward to it.\nBut sure, as someone who is terrified of climate change, I wonder if I should hurry it up and go vegan.\n51 viewsView upvotesAnswer requested by\nRaghunandan R C\n3\n1",
            "isRelated": false,
            "isRequested": true,
            "views": "51",
            "upvotes": "3 Upvotes"
        },
        {
            "author": "Why do some people return to eating meat after they have been vegetarian for many years? — Related",
            "author_bio": "Lemonsherbet04",
            "text": "3y\nI was vegan for 5 years. I felt great for the first year, but after that, my health began to gradually decline. At first I attributed my health issues to stresses in my personal life, thinking there was no way my diet could be the culprit. I began adding in supplements to help ease stress, and sure it helped for a while.\nBut I kept losing weight. I was tracking everything on Chronometer, making sure I was getting everything I needed. Every day my numbers within the app looked great, so I couldn't figure out what was going on. I began having panic attacks on a daily basis, which was something I'\nContinue Reading\n57\n1\n6\nFrancis Vincent\nAuthor has 6.9K answers and 5.8M answer views4y\nI was a vegetarian for 34 years. Truthfully I had thought about going back to eating meat a few years. I found that being vegetarian was sometimes counterproductive to the reasons I became one in the first place. One of the reasons was to reduce the environmental impact of meat production but there were times when I threw food away because it might have lard or chicken stock in it. Throwing food away is more wasteful than not. I also became a vegetarian for health reasons but there were times when I was traveling when the only vegetarian option at a restaurant was a rich cheesy pasta dish but they also served grilled fish and steamed vegetables which would be healthier. The reason I ended up going back to eating meat was to try the trendy paleo diet to lose weight. The diet didn't really work out for me. It is really hard to stay on and I didn't lose much weight. When I started eating meat again I ate a lot of it because of the novelty of it but now I'm cutting back. I don't think I'll ever go back to being a strict vegetarian. I think I'll eventually be a flexitarian or a near-vegetarian that eats mostly vegetarian most of the time. That way I can eat meat when it is the best option.\n176.1K viewsView upvotesView 7 shares\n1 of 106 answers\n539\n7\n169\nRichard Bayston\n8y\nI was a vegetarian from birth until I was about 24, 25. I spent a couple of years as a vegan too.\nThen I started eating meat.\nHere's what I noticed:\nI put on about 14lb of muscle in about 6 weeks when I started eating meat.\nI don't get so hungry that I feel dizzy and sick two or three times a day any more.\nNo real digestive issues. No - despite having literally never eaten meat before, I didn't feel sick, or suffer from indigestion, constipation, conniptions or divine intervention.\nSo why did I start eating meat?\nMainly because I realized that I didn't really take vegetarianism seriously any more. T\nContinue Reading\n62\n3\n7",
            "isRelated": false,
            "isRequested": false,
            "views": "176.1K",
            "upvotes": "539 Upvotes"
        },
        {
            "author": "Is it possible for humans to continue to eat meat without ruining the planet? How would this be achievable? — Related",
            "author_bio": "Kevin Tessier",
            "text": "Lives in Ottawa, ONAuthor has 662 answers and 1.6M answer views3y\nThere are a few ways that humans could continue to eat meat while greatly reducing their environmental impact. For a tech option, we have cultured meat\n, though it has yet to be commercialized so it’s unknown exactly how much better it will be. It is still almost guaranteed to be more efficient because they don’t need to grow organs or bones, and it will likely take less time for a similar quantity of edible meat.\nNext, assuming it wouldn’t hurt the health of the livestock too badly, we can put regulations in place to say that animals can only be fed with crop byproducts rather than expansive pa\nContinue Reading\n1\nMarchen Grith\nAuthor has 807 answers and 432.6K answer views3y\nCertainly.\nBut the level of consumption has to be like it was in the 1950’s. Meat was not an everyday thing, and they were much more careful to use leftovers.\nThe cheaper cuts of meat were used to a greater extend, in stews f.ex.\nMeat is quite important in the colder regions of the world, where fresh, locally grown vegetables are harder to come most of the year - and practically non-available in the winter. Import is not good for the environment.\n90 viewsView upvotesAnswer requested by\nCameron McCall\n1 of 6 answers\n1\nJosh Breshears\nHotel General Manager (2017–present)Author has 8.6K answers and 17.1M answer views3y\nYes but it would require moderation and most importantly changing our primary meats away from large herbivores such as cows, as those are generally the creatures that fart out the most methane gasses.\nSustainable ostrich farming is a very real possibility and replacement for cow meat if done properly.\n1",
            "isRelated": false,
            "isRequested": true,
            "views": "90",
            "upvotes": "1 Upvote"
        },
        {
            "author": "How does meat consumption increase carbon footprint? — Related",
            "author_bio": "Barbara Robson",
            "text": "Research Scientist (Modelling Aquatic Ecosystems)Author has 4K answers and 25M answer views7y\nOriginally Answered: how does meat consumption increase carbon footprint?\nWhen we eat food, we convert only a proportion of the energy in that food into the energy we need to survive and thrive (perhaps up to 50% of the energy in plants and up to 90% of the energy in meat). Only a proportion of this energy is used to grow: the rest is used to move, breathe, stay warm and so on. In the foodweb that we are part of, energy ultimately comes from the sun and is “fixed” into biomass by plants as they photosynthesise. We can either grow plants as food, or we can grow plants as food for animals, but either way we need to dedicate land and resources to growing plants.\nAs a ve\nContinue Reading\n4\nGary V Deutschmann Sr\nCEO - Classic Haus Limited, L.C.Author has 4.6K answers and 2.3M answer views3y\nCarbon is an element that can neither be created nor destroyed.\nBy eating meat you are only recycling carbon.\nDoesn’t matter how big your shoe size is!\n382 viewsView upvotes\n1 of 12 answers\n2\nTed Redmond\nEnvironmentalist, Social Entrepreneur, Architect,Author has 510 answers and 457.2K answer views7y\nOriginally Answered: how does meat consumption increase carbon footprint?\nThere are three ways meat consumption contributes to man-made greenhouse gas emissions.\nFirst, in many parts of the world forests have been cut down in order to support agriculture. In some places (including rain forest locations) this has specifically happened in order to support the beef industry. Meat production requires significantly more land to create every calorie of food than vegitable growth (we have to feed the cow for months before we slaughter it. Deforestation is a significant driver of the increase in atmospheric greenhouse gas because the elimination of forests reduces the Ear\nContinue Reading\n14\n1\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "382",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "To what extent would eating less meat help the climate? — Related",
            "author_bio": "Ross Christensen",
            "text": "Chef/Culinary DIrectorAuthor has 1.5K answers and 1.1M answer views1y\nThere are fewer animals on the planet now than there was 300 years ago, if animals had anything to do with climate we should be getting colder now\n5\n1\n5\nHarold Green\nraised and sold freshwater and marine fish for over 60 yearsAuthor has 15.8K answers and 55.8M answer views1y\nThere’s no reason to believe meat damages the environment. Farming uses far more fuel, oil for fertilizers and chemicals, uses far more water, releases carbon stored in the soil, makes the soil less able to absorb co2. Those majestic herds of bison from the past were about and numerous as todays cattle. And grazing actually improves the soil. The bad numbers always boil down to using feed lot data and that’s stretching the truth way out of proportion.\n83 viewsView upvotesView 2 shares\n1 of 29 answers\n6\n2\n1\nMary Clayton\nLived in PNWAuthor has 5.6K answers and 1M answer views1y\nit would not.\n7",
            "isRelated": false,
            "isRequested": false,
            "views": "83",
            "upvotes": "6 Upvotes"
        }
    ],
    "Will moving to a plant-based/vegan diet drastically cut down on greenhouse gas emissions and fight climate change?": [],
    "To solve climate change, should we go vegan and burn less fossil fuels or eliminate fossil fuels and eat less meat?": [
        {
            "author": "What do we use fossil fuels for? — Related",
            "author_bio": "Shimir Satyendra",
            "text": "Managing Partner at One AtomAuthor has 59 answers and 301.8K answer views6y\nFossil fuels are used to fuel cars and airplanes, power electricity plants, and heat homes.\nThey are also used to make medicines, cosmetics, plastics, synthetic fabrics and lubricants.\nShoes, toothpaste, sunglasses, tires, tennis balls and TVs are also products of oil and gas.\n20\n3\nRobert Pattison\nI have lived and worked in several countries and read widely .Author has 10.8K answers and 2.6M answer views3y\nEvery mechanical device needs a lubricant.\nThere are synthetic oils, but these are made of modified fossil oil.\nSteel can be made without coal, but would be very very expensive.\nEver since South Australia closed its coal fired power stations, the price of electricity and the price of its distribution has gone up and up.\nFossil fuels will be around for a long time to come. They have underpinned the developed world, and the developing world wants what we have.\n836 viewsView upvotes\n1 of 42 answers\n6\nVincent Hill\nVarious Temp Work for Texas State (2019–present)Author has 810 answers and 3M answer views7y\nHistorically they were important because they provide cheap energy, and they're still important now because they provide said energy. They were considered a miracle - you could have all the energy you wanted, and they took the world by storm. They still provide some of the most fuel efficient energy we have.\nAll of our modern transportation systems rely on fossil fuels. Plastics rely on fossil fuels, as does most of our industrial production. More than 3/4 of the world's energy is provided by fossil fuels right now. This means that it's thanks to fossil fuels that we have food available wid\nContinue Reading\n7",
            "isRelated": false,
            "isRequested": false,
            "views": "836",
            "upvotes": "6 Upvotes"
        },
        {
            "author": "What fuel shall we use if all fossil fuels are used up in the world? — Related",
            "author_bio": "Edward Hutchinson",
            "text": "Former Retired Computer ProgrammerAuthor has 5.6K answers and 1.2M answer views2y\nA large amount of the fossil fuels now used can be replaced by efficiency. If every building in the country was treated to a deep energy conservation retrofit the use of energy in buildings nationally would be reduced by more than half.\nWe have made great progress in lighting. LED lighting uses a fraction of the amount of energy consumed by incandescent light of equal brightness. It is even substantially more efficient than halogen or fluorescent lighting.\nThere is a substantial amount of inefficient “outdoor” lighting remaining in the country. Because of the long daily duty cycle of outdoor lig\nContinue Reading\n4\n1\n8\nRobert Droege\nFormer Worked in the Power Industry World Wide for 40 Yea at RetirementAuthor has 2.1K answers and 194.2K answer views3y\nNuclear. Because it can generate electric power 24 hours a day. And with recycling of their nuclear waste, eventually (300–400) years, what can’t be used decays to background radiation.\n240 viewsView upvotesAnswer requested by\nThe Shy\n1 of 78 answers\n5\n1\nAnton Carver\nFormer Staff Software Engineer at Google (company) (2003–2016)Author has 22.9K answers and 7.2M answer views2y\nIn reality things are rarely completely something or completely not something. That is a problem with the kind of black and white thinking in the formulation of the question. A more rational approach would be to consider the relative environmental impact of different energy sources and/or fuels. Renewable energy has the lowest overall environment impact and combined with electrification can provide very low impact solutions to the vast majority of civilization’s energy demands. Aviation and shipping are the least well solved by this approach—biofuels, synfuels and green hydrogen are possible s\nContinue Reading\n12\n1\n1",
            "isRelated": false,
            "isRequested": true,
            "views": "240",
            "upvotes": "5 Upvotes"
        },
        {
            "author": "Are you in support of measures to address climate change but stop short of full break with fossil fuels? — Related",
            "author_bio": "Phillip James Schaps",
            "text": "B.A. in Aerospace and Aeronautical Engineering & Humanities (college minor), Embry-Riddle FL/AZ (Graduated 2013)Author has 13K answers and 2.9M answer views1y\nI support a full break from fossil fuels. Even if climate change wasn’t real and wasn’t our fault, we should still stop using fossil fuels because of the other negative effects of its extraction and use. Also it’s old technology that we don’t need anymore.\n4\n1\n1\nMark Werner\nInterested in general science since childhood.Author has 48.3K answers and 62.6M answer views1y\nMany years ago, Buckminster Fuller said….”One day we will realize that crude oil is far too valuable to simply burn up in auto engines.”\nIt’s doubtful that we’ll ever stop “using” this resource, but we may be able to quit burning it up.\nJust consider how much of our current technological world is made up of things like plastic…..\nWe obviously can’t “just stop” using internal-combustion engines…. And for some uses this may have to continue for some time.\nBut we can phase out a great deal, and we can find technological solutions to minimize or sequester the carbon produced by what we do use.\n47 viewsView upvotes\n1 of 15 answers\n2\n1\nSalvatore Barrera\nAuthor has 21.1K answers and 4.9M answer views1y\nOnly and only and only untill we have achieved full wattage energy storage capacity from the overall renewable energy sources that are guaranteed fot 24/7/365 on-demand requirements UNFAILINGLY without combusting a scintilla of 1/1,000,000,000,000 or 1 trillionth of a hydrocarbon molecule that can also attain, sustain, retain, and maintain the world’s Gross Domestic Products.\nIs this possible in 2022, without thinking futuristically ?\nNO WAY !\n2",
            "isRelated": false,
            "isRequested": false,
            "views": "47",
            "upvotes": "2 Upvotes"
        }
    ],
    "Why do vegans and vegetarians use the meat climate change argument when they often have animals and children?": [
        {
            "author": "Preman Tilson",
            "author_bio": "Lives in Wellington, New ZealandAuthor has 18K answers and 14.9M answer views1y",
            "text": "Related\nWhy do vegans/vegetarians judge and shame people for eating meat when animals kill and eat each other all the time?\nAnimal behavior is completely irrelevant. Only humans have freedom to choose and enough intelligence to understand the repercussions of our choices; therefore, only we can be morally/ethically judged.\nWhether or not people should be judged/shamed for eating meat is a separate question, but the fact that animals kill and eat each other is not a factor.\n1K viewsView upvotes\n1 of 6 answers\n21\n21",
            "isRelated": false,
            "isRequested": false,
            "views": "1K",
            "upvotes": "21 Upvotes"
        }
    ],
    "What do vegans believe about climate change?": [
        {
            "author": "Rosalind Dalefield",
            "author_bio": "Double Board-certified toxicologistAuthor has 12.6K answers and 20M answer views2y",
            "text": "Related\nWhy do people tend to dislike the idea of a vegan future as we will have to some point to prevent climate change?\nThere is no evidence that the human race will have to go vegan to head off climate change. Eat less meat, very possibly. Use primarily lab-grown meat and dairy, very possibly. But completely abandon eating meat, fish, and dairy? No.\n48 viewsView upvotes\n1 of 20 answers\n3",
            "isRelated": false,
            "isRequested": false,
            "views": "48",
            "upvotes": "3 Upvotes"
        }
    ],
    "Is meat the leading contributor to climate change as vegans mostly say? What is your opinion?": [],
    "What would soft climate change more efficiently, to use nuclear energy or the worldwide population turning vegan?": [],
    "If everyone became vegan or lacto-ovo vegetarian would it be better for the Earth and fighting climate change?": [
        {
            "author": "Lauren Campbell",
            "author_bio": "Advocate without a label.Author has 5.4K answers and 27.9M answer views4y",
            "text": "Related\nAs a climate change advocate would you give up eating meat, as it is one of the biggest contributors to the global warming and uses much more resources to produce the same amount of energy as vegetarian/ vegan food does?\nOriginally Answered: As a climate change advocate would you give up eating meat, as it is one of the biggest contributor to the golbal warming and uses much more resources to produce same amount of energy as vegetarian/ vegan food does?\nI already did.\nThe next step is refining my vegan diet to be even more environmentally friendly. This probably means cutting out things like quinoa which are resource intensive.\nI mostly already avoid almonds because of the demands almond crops place on bees, besides my almond butter which I buy and use for a long time.\nI already seek to avoid palm oil, sustainable palm oil or otherwise.\nAnd I like to support fair trade companies because that usually ensures better pay and conditions for the workers.\nIdeally, once I am able to move I will be able to have my own garden where I can grow a lot of my own food. I envision some fruit trees and a nice vegetable garden. I'm also lucky to have a nice farmers market near me. The more I can support local crops and grow my own, the better.\n473 viewsView upvotes\n1 of 31 answers\n6",
            "isRelated": false,
            "isRequested": false,
            "views": "473",
            "upvotes": "6 Upvotes"
        }
    ],
    "If individual change on a personal level doesn't matter, then why does veganism have the biggest impact on mitigating man-made climate change?": [
        {
            "author": "If everyone were vegan what impact would that have on climate change? — Related",
            "author_bio": "Mark Trexler",
            "text": "Former IPCC authorAuthor has 181 answers and 157.4K answer views7y\nThe impact would actually be pretty dramatic. Starting with the estimate that 15% of human GHG emissions are associated with livestock production.\nMajor cuts of greenhouse gas emissions from livestock within reach [ http://www.fao.org/news/story/en/item/197608/icode/ ]\nBut the ramifications are actually considerably broader than that. Many (many!...\nAccess this answer and support the author as a Quora+ subscriber\nAccess all answers reserved by\nMark Trexler\nfor Quora+ subscribers\nAccess exclusive answers from thousands more participating creators in Quora+\nBrowse ad‑free and support creators\nStart free trial\nLearn more\n378 viewsView upvotesAnswer requested by\nDavid Irvine\n1 of 2 answers\n4\n1",
            "isRelated": false,
            "isRequested": true,
            "views": "378",
            "upvotes": "4 Upvotes"
        }
    ],
    "Help. What if someone's parents are against climate change, wants to shoot blacks, thinks that being vegan is horrible, pigs, drinks a bottle of wine everyday and thinks that they're always right when they didn't even graduate from HS?": [],
    "Why aren’t more people vegan, when it’s been proven that animal agriculture is one of the cruelest industries out there, as well as a leading cause of environmental destruction and climate change?": [],
    "I'm a vegan, but I would like to know what else I can do to reduce climate change. What is the biggest impact I can make without drastically changing my life?": [
        {
            "author": "What is the one best thing everyone could do to slow down climate change? — Related",
            "author_bio": "John Baez",
            "text": "Mathematical PhysicistAuthor has 108 answers and 525.8K answer views12y\nActively seek correct information on climate change and your role in causing it, and take action accordingly.\nThis answer may seem annoyingly vague. The problem is that no one action is best for everyone.\nMost of the global warming since 1950 is very likely to have been caused by the sudden spike in greenhouse gases: mostly carbon dioxide from burning fossil fuels, but also methane from cattle and other sources. By now carbon dioxide concentrations have shot up from 290 to 390 parts per million. If we continue 'business as usual' we may easily reach 1000 parts per million or more by the end\nContinue Reading\n35\n7\n1\nCJ Martin\nProfessional Generalist (1969–present)Author has 78 answers and 19.5K answer views4y\nPolitical activism is the clearest path to changing our carbon based economy. It is fruitless to alter individual behavior without addressing our collective behavior.\nWhen we used less gas, increased supply resulted in lower prices. This was followed by greater usage and larger vehicles. This is our recent history. Energy conservation has progressed hand in hand with increased consumption.\nWe must change the economic rewards and costs. Policy and innovation are the primary drivers of these changes. Politics is the one path that offers the world the most realistic way out of this catastrophe. Political failure will undoubtedly damn mankind.\n363 viewsView upvotes\n1 of 35 answers\n11\n1\nDavid Charles Leithauser\nI wrote a book on global warming denialism.Author has 13.3K answers and 5.8M answer viewsUpdated 4y\nReduce your own carbon footprint by using as little energy as possible. Use LED lights, high mileage cars, energy efficient appliances, etc.\nHowever, the biggest thing you can do is vote for politicians who will work to slow down climate change. Unfortunately, this has become such a partisan issue that this basically boils down to voting the straight Democratic ticket. (This may change in the future.) Also, let the politicians know this is an important issue for you. Write to them, sign petitions, etc.\n7\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "363",
            "upvotes": "11 Upvotes"
        },
        {
            "author": "How did going vegan impact your life? — Related",
            "author_bio": "Nikhil Suri",
            "text": "Entrepreneur (2013–present)3y\nOriginally Answered: How has veganism changed your life?\nI have been vegan for 30 year's and only one in my friend zone. My persistent have failed theirs efforts to convert me into non -vegan. Hence, many times hanging out with them made me feel unsociable. Know as I grow older this conversation led to social distancing from my friends and thus turning me into lonely and Orthodox one 😔.\nBut the matter of fact is now I realized as I am becoming more wise. How staying vegan throughout my life has enchanced my life. No offence to non vegan it's my personal perception about whole concept like everybody has it's own.\nFirstly I have lot of patience. I don'\nContinue Reading\n4\n1\nSristi Priya\nLearnerAuthor has 1.2K answers and 5.6M answer views5y\nI am not yet a vegan but a vegetarian. I have written an answer to a similar question. The last paragraph answers this question. Here is the link :\nSristi Priya's answer to Would you adopt a vegan diet? And why or why not?\nThank you !\n243 viewsView upvotesAnswer requested by\nKaan Ceylan\n1 of 30 answers\n5\nKshama Shah\nProud vegan since 20165y\nGoing Vegan has made my life stressless :\n1.I know I am Eating something and not someone.\n2.I have stepped back in supporting global warming.\n3.I eat green and healthy.\n4.I don't drink milk,that was supposed for some kid.\n5.I don't consume casien or lactose that are potentially injurious to health.\n6",
            "isRelated": false,
            "isRequested": true,
            "views": "243",
            "upvotes": "5 Upvotes"
        },
        {
            "author": "Since climate change is probably never going to be fixed, should I give up on the future? — Related",
            "author_bio": "Simon Brown",
            "text": "I care about this stupid planet and it's stupid inhabitants because I'm stupidAuthor has 2.9K answers and 10.4M answer views3y\nWhile I can understand your concern Terry, and the anger that the younger generation are feeling toward business leaders, politicians and older people in general, I don’t think you should give up on having a future.\nThe hideous nature of those in positions of power that cause people like you to question your futures is so appalling that it’s difficult to describe their combined wickedness. These people have put their wealth, power and ideology before untold billions of life forms suffering and death. The extent of suffering and loss is almost unimaginable. And for what?\nSo there are utter fuckin\nContinue Reading\n3\nAdrian Crowe\nLives in AustraliaAuthor has 35.2K answers and 25.4M answer views3y\nWhatever the future holds, unless it is oblivion for everyone and everything (and that is unlikely at this stage, there is something you can do to make it better or worse. And it is your duty to choose option 1: better.\nSo get to work.\n314 viewsView upvotesView 1 share\n1 of 14 answers\n9\n1\nRichard Rothwell\nFormer Senior Software Engineer in Data AnalyticsAuthor has 9.3K answers and 1.3M answer views3y\nIt’s not bring ignored.\nMany governments and businesses are doing their bit. Maybe not enough now, but this is certainly ramping up.\nThe technology is making major strides, with electric cars, domestic solar power and new industrial processes.\nJust vote for governments that take this issue seriously.\n2",
            "isRelated": false,
            "isRequested": false,
            "views": "314",
            "upvotes": "9 Upvotes"
        }
    ],
    "I’ve become vegan, barely use the car, and live a plastic free lifestyle, but climate change has gotten worse. Therefore, what can any one person not in charge of big businesses realistically do?": [],
    "Why are republicans much more intelligent than vegans? I estimate the IQ of a vegan is 70 or less. Meat does not emit gases. There’s no way eating meat causes climate change. Scientists should understand that meat doesn’t cause global warming.": [],
    "If you are against climate change, what percent do you feel that the diet is part of it like Greta Thunberg is a vegan?": [
        {
            "author": "Jayne Kulikauskas",
            "author_bio": "eats meat drinks waterAuthor has 496 answers and 347.8K answer views4y",
            "text": "Related\nCan becoming a vegan save the planet from permanent damage done from climate change?\nNo. The opposite is true. There is a kind of agriculture called regenerative agriculture that can reverse damage to the environment. It involves raising livestock and people eating meat.\nCurrent conventional agriculture uses artificial fertilizer which is made from non-renewable resources and creates a huge amount of emissions. It destroys soil, air, and water. Regenerative agriculture, on the other hand, functions more like an natural ecosystem. Ruminants graze on grassland and their manure acts as a natural fertilizer which builds up soil quality and sequesters carbon. Grassland is healthier when animals are properly grazed on it which in turn improves air and water. People then eat the ruminants or use them as a source of milk.\nWe certainly do need to stop producing both animal and plant based food the way that we currently do. It is destructive and inefficient. But all the vegan factoids about how bad it is to eat meat are based on assuming that food will continue to be produced this way. Merely refraining from eating animal products while continuing to raise plants with conventional agriculture is not going to fix problems with the environment. All agriculture, both plant and animal, needs reform. And if we do this, then eating meat will not be harmful to the environment, but rather beneficial.\n592 viewsView upvotes\n1 of 2 answers\n10\n2",
            "isRelated": false,
            "isRequested": false,
            "views": "592",
            "upvotes": "10 Upvotes"
        }
    ],
    "The Mayor of New York got up on in front of a mic and condemned meat and dairy in the name of climate change. Will Democrats start trying to force veganism on the USA?": [
        {
            "author": "Paul Hope",
            "author_bio": "Teacher, chess enthusiast, amateur weathermanAuthor has 657 answers and 86.3K answer viewsApr 19",
            "text": "Will Republicans over-react to everything Democrats say?\nMeat consumption uses far more resources than vegetable consumption. Eating meat is bad for the environment, simply because of the acreage per protein produced. Additionally, meat produces much more CO2 than do vegetable proteins. These are facts.\nShould people not say things that are true because they upset your sensibilities?\n28 viewsView upvotesAnswer requested by\nPerson\n2\n1",
            "isRelated": false,
            "isRequested": true,
            "views": "28",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "DAYLITE",
            "author_bio": "Working to Abolish Animal AbuseAuthor has 5.7K answers and 418.7K answer viewsApr 19",
            "text": "I sure hope so considering animal ag is responsible for 51% of greenhouse gas impact, not to mention the pure evil of factory farms. Making non-human animals no better than plants.\n6 viewsView upvotesAnswer requested by\nPerson\n1",
            "isRelated": false,
            "isRequested": true,
            "views": "6",
            "upvotes": "1 Upvote"
        }
    ],
    "What’s up with wanting climate change to come from corporations instead of themselves taking the approach of going vegan?": [],
    "Should meat eaters be taxed at higher rates than vegans given Meat eater behaviour is responsible for climate change, animal murder, domestic pollution?": [
        {
            "author": "Ken",
            "author_bio": "Author has 894 answers and 73.1K answer views3y",
            "text": "Absolutely not. I do believe progressives should be taxed at all the rates they propose everyone else should be taxed at. And the rest of us at the rates we want to be taxed at. Meat eating has absolutely nothing to do with anything such as climate change. It just pisses vegans off that we eat meat. To each their own .\n29 viewsView upvotes\n2",
            "isRelated": false,
            "isRequested": false,
            "views": "29",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "How do some meat eaters justify opposing hunting? — Related",
            "author_bio": "Patrick Davies",
            "text": "Cabinet MakerAuthor has 784 answers and 803.7K answer views4y\nWell, most people I know of who eat meat and are opposed to hunting are opposed to it for one of two reasons.\nTrophy Hunting. This is the firm of hunting I oppose. Any animal we intentionally hunt is to be eaten. That's my opinion. I've met a few hunters who agree with me on that score.\nEcological sustainability. BBecause hunting has some ecological impact, not all people are in favor of it, and are concerned about the possible impact of the harvest of wildlife.\nI don't hunt myself simply because I have enough hobbies, and I'm not hunting for subsistence.\n169 viewsView upvotes\n1 of 2 answers\n3\nWalter Libl\ngrowing exotic fruit trees as a hobby, for yearsAuthor has 4.1K answers and 1.4M answer views4y\nI'd say some do not like the trophy hunting, which might be a good thing. The hunting for food or any other reason, apart from the trophy hunting, seems only natural for us men. I have been known to hunt, but only for a reason, i.e. the pot, skin etc.",
            "isRelated": false,
            "isRequested": false,
            "views": "169",
            "upvotes": "3 Upvotes"
        },
        {
            "author": "Why do people get so defensive about being a meat eater? — Related",
            "author_bio": "Esther Seib Shelley",
            "text": "Registered Acupuncturist; Clinic Owner (2006–present)Author has 649 answers and 1.1M answer views4y\nBecause most people take it as a rejection of their way of eating. It has nothing to do with meat, believe me.\nI put classy tasteful purple streaks in my hair. My sis in law said, I could never do that! I said, good! If you did, I'd have to change mine!\nI homeschooled my kids. People said, I could never do that!\nAs soon as you take a different track than most people, it shakes the ‘pack'. Everyone likes to feel part of a group. A pack effect. A mutual validation pack. When you step out of the pack, you give its members a jolt. Should I do that, too?\nThey are forced to make a decision. Do I stay wi\nContinue Reading\n19\n8\nGerardo Aguirre\nStudied at The University of Texas at Austin (Graduated 1992)Author has 15.5K answers and 10M answer views4y\nBecause in the past twenty or so years, it has become fashionable to not only be vegetarian or vegan, but to give others grief over not doing the same.\nEat whatever you care to, just don't get in my face about it.\n60 viewsView upvotes\n1 of 10 answers\n2\nAlec Maltz\nStudied Archaeology (college major)Author has 280 answers and 247.8K answer views4y\nI’m writing this as I sit in a Korean restaurant waiting for marinated beef short ribs (Galbi) and spicy tofu soup (Soon Tofu) and an assortment of pickles and side dishes (Banchan). I just got off working a 12 hour shift (12 hours driving in the world famous Los Angeles traffic) and am very hungry. If someone tried to take my delicious short ribs from me I might attack them. If someone told me I shouldn’t eat them I might react as though they were telling me to murder my family. These are foods that I canNt help but smile while I eat. They are foods I have after painful break ups and the pass\nContinue Reading\n2\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "60",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Why is it more expensive to eat vegan when you eliminate the meat? — Related",
            "author_bio": "Beth Goldowitz",
            "text": "home cook with 50 years experienceAuthor has 17.9K answers and 57.5M answer views5y\nIt isn’t. It’s only expensive if you insist on buying processed foods made with vegan ingredients instead of cooking your own food. You don’t need to buy vegan burger patties, you can make your own with brown rice, black beans and fresh herbs and spices. Fast, easy and delicious, at less than 1/3 the cost of buying a pre-made, frozen vegan patty. You can buy things like grains, seeds and nuts in bulk and save a lot of money over buying individual servings or smaller packages. If you stick to seasonal vegetables grown in your area instead of insisting on buying tomatoes and blueberries in the d\nContinue Reading\n31\n7\nDonna Fernstrom\nLives in VirginiaAuthor has 9.7K answers and 85.2M answer views5y\nIf you’re a person who has the time and energy to cook everything from scratch, and you don’t live in a food desert, it’s not more expensive to eat vegan.\nHowever, if any of the above isn’t true, it is more expensive to eat vegan. This is because most processed foods are not vegan, and specialty foods cost more. It may be necessary to travel to acquire sufficient variety of foods to make up a complete diet, and of course supplements are necessary on a vegan diet.\n4.2K viewsView upvotesAnswer requested by\nJi Ok Soon\n1 of 14 answers\n16\n1\nShaun Haney\nSlowly readopting the vegan lifestyle.Author has 2.4K answers and 2.7M answer views5y\nOriginally Answered: Why is it more expensive or same price to eat vegan at a restaurant when you eliminate the meat?\nDepends on how you do it. There was a pasta restaurant that charged the heck out of me when I ate vegan there because they had a pasta primavera with cheese or a build your own pasta. The pasta primavera? About $12.99. An equivalent build your own pasta? $25.99 because they charge per topping like pizza.\nGo to a typical sandwich shop. Order a sandwich which looks pretty good except it has meat and cheese. Leave off meat? No change in price. Leave off cheese? No change in price. Add avocado? 2 dollars extra! But l left off the meat and cheese? Yeah, what's your point? Avocado is extra.\nVegan item\nContinue Reading\n5",
            "isRelated": false,
            "isRequested": true,
            "views": "4.2K",
            "upvotes": "16 Upvotes"
        },
        {
            "author": "How can hatred between vegans and meat eaters be controlled? — Related",
            "author_bio": "Jack Unsworth",
            "text": "Author has 1.2K answers and 250.2K answer views4y\nThere are some animal rights people who take things a bit too far and annoy people by, for example, going into meat serving restaurants and shouting at people. And there are some meat eaters who just think all vegans are that annoying.\nBut overall, there isn’t much of a problem.\nAnd you can’t solve a problem like this by, as you suggest, making it all ‘controlled’.\nBut sure, people could do with learning not to get so upset with people with different beliefs from theirs. The more annoying of the vegans might have to be less angrily preachy, or smug about themselves, and some constructive dialogue\nContinue Reading\n2\n1\nGary Braithwaite\nI like food. It often tastes good.Author has 6.9K answers and 2.2M answer views4y\nI don't accept that such hatred exists.\nThere are a few fringe elements on both sides who seem to take offence at the dietary choices of the other side, but frankly for most it's a non-issue.\nIt's like any conflict. If people want to fight, they will. However, on this topic there's no riots because someone didn't want a meat-based meal, nor are there vegans roaming en masse to destroy any fast-food place that serves meat.\nWhat you describe doesn't exist.\n19 viewsView upvotesAnswer requested by\nBenjamin Lewis\n1 of 9 answers\n1\nNatarajan Shanker\nVegetarian turned meat-eater turned vegetarian againAuthor has 407 answers and 1M answer views4y\nHatred shouldn’t be controlled, it should be erased.\nHatred comes from ignorance. Vegans think animal-eaters are selfish and cruel. Meat-eaters think vegans are judgmental condescending pricks with identity issues. And so on. I don’t think any of these assumptions is necessarily true.\nHere’s my stance. I was born and raised vegetarian. At the age of 30 I started eating meat, and ate it for a little\nContinue Reading\n4\n1",
            "isRelated": false,
            "isRequested": true,
            "views": "19",
            "upvotes": "1 Upvote"
        }
    ],
    "Is it more useful in the battle against climate change for an individual to go vegetarian/vegan or to not drive a fossil fuel powered automobile?": [
        {
            "author": "Johnny Fly",
            "author_bio": "Studied Wirtschaftsinformatik at Hochschule Ravensburg-Weingarten1y",
            "text": "Related\nWhy do vegans say they refuse to use any animal byproducts but still find it okay to drive gas powered cars? Gas is after all a byproduct of animals.\nThere is no direct harm that is done when you drive a gas-fueled car. Gas is just biomatter from a million years ago. Maybe in a million years from now, another species will drive their cars with our remains. If gas was gathered from animals by mass-breeding and kill them, then most vegans would probably stay away from driving gas-fueled cars.\nA common mistake that is made when talking about veganism is to ignore the official definition of veganism. Veganism is not defined as not eating meat or animal excretion (that is just one consequence) or using anything that comes from animals but:\nVeganism is a philosophy and way of living which seeks to exclude—as far as is possible and practicable—all forms of exploitation of, and cruelty to, animals for food, clothing or any other purpose…\nSo to come back to the question:\nThe use of gas does not represent a form of exploitation of, or cruelty to animals. Therefore gas is vegan.\n503 viewsView upvotesView 1 share\n1 of 10 answers\n8\n1\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "503",
            "upvotes": "8 Upvotes"
        }
    ],
    "How has the vegan movement developed in response to global climate change?": [],
    "Why do some people think that vegan food production and transportation contribute to GHG emissions and climate change? If so, is this issue big enough to talk about on international platforms?": [],
    "Why is McDonald’s phasing out all junk food by 2050? Climate change is a hoax. We should ban meat, dairy, soda, etc. I don’t want a crappy McDonald’s burger with no fries and water. Vegan diets are boring. https://www.today.com/today/amp/rcna104432": [],
    "Why do some people deny climate change?": [
        {
            "author": "Richard Muller",
            "author_bio": "CoFounder, Berkeley Earth, Prof Physics UCBerkeley, Energy for Future PresidentsUpvoted by",
            "text": "James Hovater\n, M. Edu Education & Science, Freed-Hardeman University (1998) and\nRichard Feenstra\n, holds a doctorate in educational psychology.Author has 2.3K answers and 229.4M answer views7y\nOriginally Answered: Why do climate change deniers deny climate change?\nMany people dismiss all claims of climate change because the exaggerators have said so many things that are not true. When you learn that the polar bears are not dying from receding ice, that Kilimanjaro is not melting because of global warming, that hurricanes are not increasing in number, that neither are tornadoes, that malaria is not spreading from the heat -- it is tempting to throw out everything. When you were told back in 1999 that the recent surge in temperature was our last warning (we now know it was a short burst due to El Nino), and that if we didn't act in the next 5 years it would be forever too late -- and then you learn that here in 2015 it still isn't too late -- you are tempted to think the whole thing is nonsense.\nThe problem is that scientists have become advocates and they have been spinning the data, to emphasize only the data that shows impending disaster, and not the data that counters it. In other words, too many scientists have been acting like politicians and lawyers, and as a result, much of the public has lost faith in scientists.\nI feel that the proper role of scientists is to present the data clearly, fairly, and objectively. Warming in the past 50 years has been less than 1 C, and that knowledge might cause some in the public to dismiss the danger. Scientists need to acknowledge that it has been small, but that expected increases in carbon dioxide emissions are about to accelerate the warming, and that the threat lies in the future. We have to trust the public and the politicians to understand what we say. When we exaggerate, we have a temporary effect (as did the movie \"An Inconvenient Truth\"), but when they discover that we scientists have been exaggerating, it is difficult to win back their trust.\n261.2K viewsView upvotesView 98 sharesAnswer requested by\nAustin Conlon\n7.6K\n98\n905",
            "isRelated": false,
            "isRequested": true,
            "views": "261.2K",
            "upvotes": "7,691 Upvotes"
        },
        {
            "author": "Omar Bessa",
            "author_bio": "Former Design and Operations at EPIC AEROSPACE (2019–2019)Author has 2K answers and 10.3M answer views5y",
            "text": "Related\nIs global warming really an issue?\nMy house is just 9 meters above sea level. What’s more, in the Gulf I live in there’s a high tide range. An extraordinary tide is about 10 or so meters. You can guess where this is going…\n…and since I'm right next to it, any of those big tides could get inside my house if it weren't for the well placed defenses next to it.\nJust one or two more meters and the defense will be overrun. My house, my neighbors, all the people I know. Underwater.\nDue to the excellent benefits seas and rivers bring to civilization, a large portion of human populations is coastal. About 40% of the world lives near a coast. How much is that? 3 billion people? All underwater.\nIn addition to that, we might open a Pandora’s box of weather non-linearity. How are the world’s weather patterns going to change? We can’t know for sure. But it doesn't seem like it will be pretty in the short term.\nThanks for the A2A bruh.\n3.6K viewsView upvotesView 1 shareAnswer requested by\nDennis Lance\n1 of 77 answers\n28\n1\n10",
            "isRelated": false,
            "isRequested": true,
            "views": "3.6K",
            "upvotes": "28 Upvotes"
        }
    ],
    "How global warming might affect food security?": [],
    "What are the easiest steps that normal people can take to lead more ethical lives?": [],
    "How can we combat climate change?": [],
    "Why has New Zealand proposed taxing the greenhouse gases produced by farm animals when they burp and urinate as a tool in the fight against climate change?": [
        {
            "author": "James Stewart",
            "author_bio": "55 years of inquiryAuthor has 24.7K answers and 9.3M answer viewsAug 5",
            "text": "Related\nWhat are the challenges in accurately monitoring greenhouse gas emissions in New Zealand?\nBelow 16,000 feet, the atmosphere is too turbulent to accurately measure the CO2 tension (ppm) in the atmosphere. This is why it is monitored at higher elevations, and in the middle of the Pacific Ocean. Then this value is extrapolated to simulate sea level values. You cannot measure it directly.\n13 viewsView upvotes\n1 of 1 answer\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "13",
            "upvotes": "1 Upvote"
        }
    ],
    "When did you realize that \"human-caused climate change\" is completely made up and a hoax to scare people into supporting socialism?": [],
    "I use to think Trump was a bad choice for America, and the world…but now, I’m slowly starting to believe it’s necessary. Why be a part of Paris climate agreement if no one is becoming vegan and switching to public transit? You can blame the corporations and governments all you want, but at the end of the day, it’s individual behaviour and purchasing behaviours. Your dollar is your vote. He does things differently, but he’s the confidence that America lacks, to stand up for themselves and act - or change. I honestly feel he has a really good shot at winning if people don’t start changing. Because planet earth will be on his side, in order to make change happen quicker on an individual basis. Thoughts?": [],
    "If Greta Thunberg believes world leaders should listen to science's arguments, then why doesn't she support the diffusion of nuclear energy?": [
        {
            "author": "Andreas Svensson",
            "author_bio": "Studied Engineering & Video Game DevelopmentUpvoted by",
            "text": "Timo Narumo\n, PhD Applied Mathematics & Nuclear Energy, Aalto University School of Science (1997) and\nThor Bostrom\n, PhD Science, University of Sydney (1977)Author has 4.5K answers and 18M answer viewsUpdated 3y\nHere’s Greta’s position on nuclear energy:\nPeople keep asking me ”what is the solution to the climate crisis.” And how do we ”fix this problem”. They expect me to know the answer.\nThat is beyond absurd as there are no ”solutions” within our current systems. No one ”knows” exactly what to do. That’s the whole point. We can’t just lower or heighten some taxes or invest in some ”green” funds and go on like before.\nYes there are many many things that are very good and necessary, and improves the situation. Such as solar- and wind power, circular economy, veganism, sustainable farming and so on. But even those are just parts of a greater picture.\nWe can no longer only focus on individual and separate issues like electrical cars, nuclear power, meat, aviation, bio fuels etc etc. We urgently need a holistic view to adress the full sustainability crisis and the ongoing ecological disaster. And this is why I keep saying that we need to start treating the crisis as the crisis it is. Because only then - and only guided by the best available science (as is clearly stated throughout the Paris Agreement) can we together start creating the global way forward.\nBut that can never happen as long as we allow the ”yeah-but-what-about-nuclear-power-then-debate” to go on and on and on. This is wasting our time. This is climate delayer-ism. We need to keep a great number of thoughts in our head at same time and yet move forward with the changes at unprecedented speed.\nPersonally I am against nuclear power, but according to the IPCC, it can be a small part of a very big new carbon free energy solution, especially in countries and areas that lack the possibility of a full scale renewable energy supply - even though its extremely dangerous, expensive and time consuming. But let’s leave that debate until we start looking at the full picture.[1]\nIndeed she has stated that she is against nuclear power. So, why is she against it?\nTo understand this you need to understand the Swedish political landscape of the past 40 years, because nuclear energy is a hot button issue in Sweden, the support of which greatly fluctuates from year to year.\nTo summarize those 40 years, very crudely, the Swedish government used to not consider environmental issues to belong in the Riksdag, which alienated enough voters for the Environmentalist Party (Miljöpartiet) to be elected, and they’ve always been anti-nuclear. The Environmentalist Party remained essentially the only elected party which fought for environmental policies for about 2-3 decades, after which it found itself in a strategically important role in being a supporting party for the Social Democrats, in return for the Social Democrats supporting their environmental policies.\nEssentially, opposition towards nuclear power has dominated environmental discourse because of the neglect of environmental policies from the other parties, making support of nuclear power controversial.\nNow, let’s return to the question.\nIf Greta Thunberg believes world leaders should listen to science's arguments, then why doesn't she support the diffusion of nuclear energy?\nWe’ve already gone over what she herself cites as her reasons for opposing it (“… its extremely dangerous, expensive and time consuming”), and had a brief overlook of the political climate she is from, which further explains her position.\nThe thing is though, Greta is not a world leader. Her position on nuclear power is ultimately irrelevant, as she doesn’t want, nor claim to want, to be the one who’s opinion defines the path we take to combat climate change. On top of which she is not yet even eligible to vote, and when she is she'll be voting in a country that very likely can combat climate change without nuclear power.\nEven so, she’s able to concede that the IPCC says that nuclear can be part of the solution - meaning she recognizes what scientists are saying, even when that contradicts her personal opinion, which is more than one can say of her opponents.\nEdit: I'm going to be deleting all climate change denying comments that i see, because the facts are no longer up for debate. I will also delete any comments i see that insult Greta. You're entitled to disagree with her as much as you like, but i will not tolerate adults insulting children.\nEdit 2: I will also be blocking anyone who complains about the edit above. My answer, my comment section, my rules.\nFootnotes\n[1] Greta Thunberg\n108.1K viewsView upvotesView 20 shares",
            "isRelated": false,
            "isRequested": false,
            "views": "108.1K",
            "upvotes": "3,303 Upvotes"
        },
        {
            "author": "Nic Garsha",
            "author_bio": "Management & Information Systems PhDAuthor has 529 answers and 1.5M answer views3y",
            "text": "The ROI is too low. Nuclear is among the most expensive sources of electrical power.\nThere are such enormous cost overruns and delays that projects either get canceled or tax-payers get stuck with the bill.\nEven if we spent much more money learning to make it more efficient and cheap, the “learning curve” is still solidly above other cheaper alternatives.\nYou might say “stupid voters and public opinion is what is blocking nuclear.” If that were true, then you might expect China to be investing a ton in nuclear, without public opinion blocking them.\nOh, wait - it looks like they are planning on investing much more in renewables like wind and solar. Nuclear is there as well, but just isn’t cost-effective enough to be the main source of energy, even for such a powerful country as china.[1][2]\nNuclear power generates electricity and is a manageable component on grids, so it’s there with wind and solar too. They have different characteristics of electricity generation and ancillary services, but the differences don’t actually make nuclear better or worse, just different.\nIt’s low carbon, low pollution and has low mortality rates, so those are good things. It’s down there with wind and solar on those points.\nUnfortunately, it’s too expensive and too slow to build. Compared to wind and solar, it’s 3–5 times more costly per MWh and takes 3–5 times as much to build capacity capable of generating the same GWh of electricity every year. That means it can’t compete with them. This median build time for nuclear is around a decade right now. We actually need to be generating a lot more clean electricity a lot sooner than a decade or two from now.\nAnd then there are the fiscal risks. Pretty much every nuclear plant built has gone over budget and over schedule. The industry is riddled with overruns that were swept under various budgetary carpets. Ontario still has $20 billion in nuclear debt on the books. France’s Macron is on record saying he was never able to get a straight answer on how much they spent.\nAnd the other fiscal risk is liability. In the USA, it’s capped at $13 billion for private insurers, and after that it’s on the taxpayer. Given that Fukushima is going to be pushing a trillion USD by the time all the costs are counted, that’s a lot of taxpayer liability. Most rational governments aren’t interested in that, regardless of probability.\nIn 2009, it was possible to squint, think that nuclear was going to be key to the climate change solution set and have a defensible argument. But it’s 2019. We have global empirical evidence now. Nuclear isn’t needed. It’s too expensive and too slow to build compared to wind and solar, and its characteristics aren’t helpful on modern grids.\nAnybody promoting nuclear in 2019 is running a mental model which is empirically unsound, likely one that they haven’t updated for a decade as more data has arisen. They are biased thinkers.\n~ Michael Barnard's answer to Why isn’t nuclear energy talked about as frequently in the conversation of renewable energy sources?\nFootnotes\n[1] World Energy Outlook 2017 China : Key Findings\n[2] https://www.researchgate.net/figure/Sources-of-future-power-generation-in-China-under-the-International-Renewable-Energy_fig3_314131525 (https://www.researchgate.net/figure/Sources-of-future-power-generation-in-China-under-the-International-Renewable-Energy_fig3_314131525)\n388 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "388",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Yates Buckley",
            "author_bio": "Technology, Neuroscience, Long Term ThinkingAuthor has 973 answers and 927.3K answer views3y",
            "text": "Scientism and energy…\nFirst of all af hominem is not a good idea in a question and unfair to the person involved. But if I take Greta as a symbol, which is what we should consider, then she represents a certain type of EcoHolistic view that is hard to reconcile with individual issues and specific policies.\nI am pro nuclear as one in a mix but there are problems with it. I am pro in am idealist sense because I think it can lead us to future opportunities, a station on mars might run better on nuclear, this sort of argument.\nThe big problem with nuclear energy other than price compared to others is that because of potential defence transfer it requires a kind of closed engineering community that is not therefore able to innovate and improve quality of work in the same way more open sectors do.\nI believe this is one of the reasons so much innovation in nuclear happened early on. But once solutions settled in, bureaucracy build around these solutions and it becomes hard to improve costs and efficiency.\nStill a nuclear plant should be preferable to most any coal plant, for example…\n261 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "261",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Loren Petrich",
            "author_bio": "Ph.D. in Astronomy, Cornell University (Graduated 1988)Author has 1.9K answers and 1.7M answer views4y",
            "text": "There are certain people who seem to think that nuclear energy is the only legitimate alternative to fossil fuels, and that is what this question reminds me of.\nShe prefers to concern herself with getting people to recognize the problem and trying to solve it, rather than with recommending any one solution.\n136 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "136",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Louis Vaught",
            "author_bio": "BS in Civil Engineering, Rose-Hulman Institute of Technology (Graduated 2015)Author has 1.2K answers and 15.1M answer viewsUpdated 3y",
            "text": "Nuclear Energy is a massive red herring. From the perspective of high-level energy policy, it’s strictly worse than renewables in pretty much every meaningful way.\nIf you do even a little bit of research that becomes obvious really fast, and it really bothers me that I've seen a distinct group of scientists, usually physicists, who are vocal proponents. The scientific and engineering evidence about nuclear energy is surprisingly negative, in an area that's usually pretty vague. Not highly negative, but conclusive nonetheless.\nHere is a plot of the Levelized Cost of Energy, which accounts for things like partial capacity due to fluctuations:\nI highlighted Advanced Combined Cycle because that’s the term for modern Natural Gas powerplants. That’s considered a transitional energy source, and it’s pretty much what’s killing coal plants in the US.\nIf you want to have a viable alternative energy source, you need to beat that price. That’s not speculative either, there are plenty of studies that investigate that in order to study the impact of energy subsidies. For example: Are renewable energy subsidies effective? Evidence from Europe\nNuclear energy fails strongly in that area nowadays, and its yearly installed capacity reflects that.\nEven without subsidies, Wind energy meets or beats the price of Natural Gas, and Hydroelectric is right there as well. Solar is a little expensive, but there’s a pretty wide range and the price is dropping.\nHydroelectric installations are rare because the resource is very highly-exploited in the US, but new wind and solar generation is getting added in record amounts.\nSo nuclear loses on price, and isn't economically viable. Well, what about all of the capacity fluctuations from renewables? Isn’t nuclear better?\nNo, it’s not.\nNuclear energy delivers a fairly constant amount of power, but that’s not actually a benefit. The idea that you want a specific level of production is a myth, based on bad understanding of the design requirements for power grids.\nDemand actually fluctuates a lot, and there’s a massive amount of research on trying to quantify that fluctuation. The earliest papers go back decades, and you can still find a lot of recent work because we haven’t fully solved it yet: A framework for baseline load estimation in demand response: Data mining approach\nIn the absence of energy storage, you need generation that can match the changes in demand, not just produce a consistent amount of power. It turns out nuclear is really bad at that - this research paper goes into potential avenues for starting development of load-following nuclear, and it was just published in 2015: http://eprints.whiterose.ac.uk/91139/1/Accpeted%20version.pdf\nSo a grid using just nuclear energy isn’t really viable. Even in France, where the percentage of nuclear generation is very high and the reactors are state of the art, there’s still a lot of other sources to manage the capacity issues:\nThat high percentage of hydro power is really important, because pumped storage facilities\nare the only viable grid-scale source of storage we have right now, and dams can regulate how much water they release to store up energy, so they help to level out peaks and troughs in demand.\nMeanwhile, the fluctuations in renewable generation are usually overblown and misunderstood. The engineering community is completely on top of that issue.\nWind energy actually naturally solves some of its generation problems if you just keep installing more of it. The individual turbines fluctuate a lot, but the system as a whole produces a significantly more constant amount of power. As long as you only expect to get 30% of your installed capacity, then wind is fairly consistent.\nAnd the costs I listed at the beginning are “levelized” to take that into account.\nThere is a lot of research on quantifying the grid design required for wind energy, or for a hybrid wind+solar approach, and we have a pretty robust understanding of how to get from where we are to 100% renewables:\nSpectrum of Wind Power Fluctuations\nCapacity allocation of a hybrid energy storage system for power system peak shaving at high wind power penetration level\nHybrid wind/photovoltaic energy system developments: Critical review and findings\nIt’s not that it isn’t a challenge, but it’s one that we’ve studied well. We’re actually past the point of feasibility studies and on into more targeted proposals for implementation.\nIt’s doable with current technology, the main issue is economic viability.\nSo yeah, there’s no reason for developed countries to use nuclear energy beyond people being dogmatic. There’s no significant problem that it’s solving, and there’s no benefit over other options.\nUsually it's strictly worse.\n4.2K viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "4.2K",
            "upvotes": "70 Upvotes"
        },
        {
            "author": "Kevin Cameron",
            "author_bio": "Author has 3.6K answers and 2.9M answer views3y",
            "text": "The time to do nuclear was 30 years ago before renewables got going, it would be a waste of money now given the price of solar and wind power (which don’t have nearly as much risk).\nHad the nuclear industry worked out that climate change was real, we might have a lot more of it, but more of it tends to lead to more bad accidents.\n52 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "52",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Gunter Lang",
            "author_bio": "German Tutor at U3AAuthor has 1.5K answers and 425.1K answer views3y",
            "text": "Give her a break.\nHow much did you understand about diffusion of nuclear energy when you wer 16?\nHere is you answer.\n68 viewsView upvotesAnswer requested by\nNathaniel Suchy",
            "isRelated": false,
            "isRequested": true,
            "views": "68",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Trevor White",
            "author_bio": "Chemical Process Engineer at Jacobs Engineering (company) (2013–present)4y",
            "text": "Possible reasons she would be against it is risk of environmental disasters from nuclear power plants such as Fukishima, Three Mile Island, Chernobyl etc. Possibly storage of radioactive waste as well.\n206 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "206",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "John Walker",
            "author_bio": "Former Pathologist/Director of Clinical/Molecular LabsAuthor has 2.8K answers and 1.3M answer views3y",
            "text": "I do not know for sure what her reason is, but I speculate that she is either fearful of the potential hazards of nuclear power (many of which can be eliminated with newer generation power plants), or she has been indoctrinated into accepting the global socialist agenda of replacing democratic free market capitalism with authoritative global socialism.\nFor more on this see: John Walker's answer to Why do Democratic candidates such as Bernie Sanders and Elizabeth Warren seek to place a ban or rather a moratorium on nuclear energy if combating climate change is a top priority of their respective campaigns?\n255 viewsView upvotesAnswer requested by\nAlket Cecaj",
            "isRelated": false,
            "isRequested": true,
            "views": "255",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Earl Rodd",
            "author_bio": "Masters degree in chemical engineering.Author has 2.2K answers and 478.7K answer views3y",
            "text": "Because children with minimal life experience and lacking broad scientific/economics education should be entitled to some inconsistency in their views.\n50 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "50",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Svilen Fal",
            "author_bio": "Author has 4.2K answers and 1.3M answer views3y",
            "text": "Well of course world leaders should listen to experts, and be informed by science. All of science, some of which gives contradictory advice at times when trying to apply it. Then too, there are other matters, such as moral and safety and prioritization and economic ones, so in implementing science, it becomes more complicated. Even more so since government and business is involved.\nThis feisty dedicated focused Swedish teenager with the actor father and opera singer mother.\nIt’s a 16 year old.\nThat’s not a lot of time to be well educated, experienced, mutil-disciplinary. Even being related to Svante Arrhenius on her father’s side. Aside from age and experience and education it’s probably also not entirely helpful in developing a complete and informed world-view to have selective mutism, obsessive-compulsive disorder, and Asperger syndrome.\nMuch of which isn’t germane necessarily. What is it she knows about energy policy or nuclear power reactors, might be a better question, if we are looking to opinions on such matters.\n86 viewsView upvotesAnswer requested by\nAlket Cecaj",
            "isRelated": false,
            "isRequested": true,
            "views": "86",
            "upvotes": "1 Upvote"
        },
        {
            "author": "David Hague",
            "author_bio": "B.A in Theology (graduate degree) & Bachelor of Arts Degrees in Religious Studies, Christ Church, Oxford (Graduated 2006)Author has 8.5K answers and 6.5M answer views3y",
            "text": "And what makes you think a young girl like that would know anything about the diffusion of nuclear energy anyhow! She’s doing the best she can to bring awareness of the environment and she’s doing fine - respected by all !\nLets just concentrate on all that green house gases for now ! One thing at a time please ! Let’s prioritise!\nUUUUUU?\n108 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "108",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Joe Goldberg",
            "author_bio": "Author has 12K answers and 5.5M answer views4y",
            "text": "Ms. Thunberg is an unexceptional 16 year old who knows little or nothing about anything (like your standard 16 yo). She also has a number of mental challenges that make her even less capable than your standard incapable 16 yo.\nShe will be forgotten in 6 months as the Democrats and world liberals tire of her and throw her on the rubbish heap as they have done to so many in the past.\n110 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "110",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Richard Craig",
            "author_bio": "Lived in the UK and elsewhereAuthor has 1.6K answers and 1.6M answer views3y",
            "text": "With the obvious exception of Trump, the vast majority of world leaders believe they are listening to scientists. Almost all countries have signed up to various treaties and have been busy rolling out wind farms and carbon credit schemes for the last three decades. Calling them climate change deniers is absurd and probably unhelpful.\nSome scientists have recently stepped up their predictions and claim by as early as 2025 there could be irreversible climate change of up to 2 degrees. This will cause crop failures and the loss of up to 10% of arable land. These are worse case scenarios, but it can be argued we should plan for the worst case.\nHow Thunberg and others get from there to an Extinction Event is by hypothesising that the resulting famines will lead to a Thermonuclear War, and hence Everyone Dies.\nI strongly suspect that there are more than a few CND members in Extinction Rebellion. Much of the rhetoric is the same, as is their apparent assumption there is a World Government which can unilaterally force change, which can be influenced by protesting primarily in English speaking countries.\nWhile nuclear power can be achieved without producing nuclear weapons, there has always been an association between the two, and groups like CND have campaigned against both.\nOne thing ER seem blind to is that their suggested solutions, of Overthrowing Capitalism and essentially banning all forms of travel and global shipping, would also lead to famines, economic collapse and potentially war.\nAnother way to avoid the impacts of climate change is to plan for it. If 10% of arable land does disappear, we should be investing in farming production and so on, and increasing the capacity to move food from one place to another.\n183 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "183",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Peter Ned",
            "author_bio": "Author has 4.9K answers and 1.6M answer views3y",
            "text": "I think it’s preposterous to discuss some teenager’s support for nuclear energy. Or what a particular teen believes the world leaders should do. World leaders are not teenagers probably for a reason.\nAll this Greta Thunberg thing is becoming more and more ridiculous.\nAndreas Svensson even posted in his answer\n“Greta’s position on nuclear energy” ?!?? As if she’s some body of experts on the subject.\nThen, after accusing me of insulting Greta, and of implying that teens should not have opinions, Andreas promptly deleted my comments - obviously only to further strengthen his stance that everyone can have an opinion.\nSo, in “Greta’s” position on nuclear energy (go read it) you can see gems like “We urgently need a holistic view to adress the full sustainability crisis….”, among other pompous rhetoric.\nHow many teens talking like that you know? I bet none. The whole thing is so obviously not from her, that even WWF wrestling seems more authentic.\nGreta (but it could have been any other teen) was selected for the role of a talking head for the radical left spreading climate hysteria only to avoid criticism and play the victimhood card whenever necessary.\nHow dare you criticizing a child striving to save the world! Only a Nazi would do that!\nSo, why doesn't she support the diffusion of nuclear energy? It doesn’t matter.\n177 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "177",
            "upvotes": "3 Upvotes"
        },
        {
            "author": "Allan Travers",
            "author_bio": "Author has 418 answers and 142.7K answer views4y",
            "text": "Simple because she does not actually have a clue of what she speaks. Her knowledge is based on peripheral understanding of the topic based on grooming and parrot like indoctrination of the key factors. Ask her a question outside those very tight parameters and she has been reported to just clam up and stare into oblivion, and not answer the question.\n92 viewsView upvotesAnswer requested by\nNathaniel Suchy",
            "isRelated": false,
            "isRequested": true,
            "views": "92",
            "upvotes": "1 Upvote"
        }
    ],
    "Is there any data that suggests conservatives are more likely to deny science than progressives, or vice versa?": [
        {
            "author": "What is it about liberals/progressives that frighten conservatives so much? — Related",
            "author_bio": "Daniel Albert",
            "text": "used to be a conservative republican, now left of DemocratsAuthor has 6.2K answers and 6.8M answer views5y\nThey are the scary boogeyman that Sean Hannity told them was lurking in the darkness, threatening to destroy the USA by supporting seniors, gay people, women, clean up our campaign finance system, expand the medicare program which is wildly popular, hugely successful, and vitally important, join with the rest of the world in their fight against anthropogenic climate change, fix our justice system and end the barbaric prison for profit system, and do something about all these mass shootings which affect the USA every week but don’t affect other countries where owning a gun is legal but more tig\nContinue Reading\n19\n1\nDr. Zoyda Berg\nAuthor has 330 answers and 308.2K answer viewsUpdated 5y\nAs I had stated in a previous answer, recall first that:\nConservatism by its very definition is regressive, backwards looking, trying to preserve some ideal from the past and resisting change.\nLiberalism is progressive. It’s about embracing change, experimenting with the adoption of new ideas and questioning the old and traditional. If it weren’t for liberals, no progress would occur and nothing would change. BTW - the founding fathers of America were and still are considered liberals.\nAnd recall also:\n“There is nothing more difficult to take in hand, more perilous to conduct, or more uncertain in its success, than to take the lead in the introduction of a new order of things. Because the innovator has for enemies all those who have done well under the old conditions, and lukewarm defenders in those who may do well under the new. “ - Niccolo Machiavelli\n300 viewsView upvotes\n1 of 27 answers\n7\nGhost Orange\nAuthor has 16.6K answers and 37.5M answer viewsUpdated 5y\nActually, they are just generally frightened by a lot of things. That is the nature of the ‘conservative brain’. Fearful, insular, punishing. It is the older schema of brain, from a scary, primitive era. It relies on the ancient amygdala for managing risks. It needs a hierarchical social structure, a tribe and tight control of feeding and breeding.\nThe newer, ‘liberal’ egalitarian brain is more cooperative, tolerant, flexible and manages risk in the anterior cingulate cortex. It is better at planning, can tolerate diversity and population density. It is far more successful, having given us agri\nContinue Reading\n218\n1\n43",
            "isRelated": false,
            "isRequested": false,
            "views": "300",
            "upvotes": ""
        },
        {
            "author": "Why are most conservatives against modern progressiveness? — Related",
            "author_bio": "Jeff Dege",
            "text": "M.S. in Software Engineering, University of St. Thomas, St. PaulAuthor has 9.4K answers and 8.9M answer views2y\nMainly, it's because the Progressive delusion is simply false, and Progressives believe that the persistent failure of reality to abide by their misconceptions must be the fault of nefarious forces, and the anyone who disagree with them must be evil.\nBecause of this they are deeply hateful people.\n8\nMelanie Reynolds\nBeen married for 25 years Author has 10.9K answers and 10.5M answer views2y\nI think a lot of moderates and people who call themselves “Classical liberals” are also against progressiveness. It’s not just conservatives that have a problem.\nWhat do we mean by modern progressiveness? Are we talking about wokesters? I don’t think very much of them either.\nThey seem to be horrible people often and very morally blind. I am not saying 100% there are some progressives that are coming from a true and humble hope to create a better world but I guess their voices are drowned out.\nI understand from so many of the wokesters I have dealt with in recent years how Stalin and Mao and Pol Pot rose - I get it. I get how those people formed an ideology and then set about to murder their teachers and anyone who was not on board with their ideology - I can see it fairly clearly now.\n192 viewsView upvotes\n1 of 17 answers\n7\nCharles Tips\nSerious student of US and world politicsAuthor has 4.7K answers and 27.8M answer views2y\nContinue Reading\n348\n7\n43",
            "isRelated": false,
            "isRequested": false,
            "views": "192",
            "upvotes": "7 Upvotes"
        }
    ],
    "How accurate is the movie Cowspiracy?": [],
    "What do you think about Greta Thunberg, the 16-year-old climate activist? Is she a person to admire?": [],
    "What is the recent obsession with veganism?": [],
    "How carbon neutral is Greta Thunberg’s two week-long Atlantic boat trip?": [
        {
            "author": "Donald Rich",
            "author_bio": "Author has 2.6K answers and 791.3K answer views4y",
            "text": "It was carbon neutral only if you exclude all energy used outside of the two weeks she was sailed across the Atlantic.\nSails degrade from use in sunlight and take a lot of energy to make (and a lot of hydrocarbons since they are usually polymers). The energy used to create the yacht and maintain it is very high (annual maintenance of sail boats is often close to the purchase price of the ship). Two crew sailed her and her father to the US (she does not seem to know how to sail). These original crew flew home and a replacement crew flew to New York to sail the ship back.\nOverall her trip to the US cost a month of ship use, probably another couple of weeks of maintenance. Six flights (her, her father, two crews), accelerated sail replacement and miscellaneous energy costs.\nLess energy would have been used if she had just flown with her father to the US and back.\n270 viewsView upvotes\nYour response is private\nWas this worth your time?\nThis helps us sort answers on the page.\nAbsolutely not\nDefinitely yes\n3",
            "isRelated": false,
            "isRequested": false,
            "views": "270",
            "upvotes": "3 Upvotes"
        }
    ],
    "How can I make everybody in the world go vegan and stop animals from getting hurt or killed?": [],
    "Is \"climate change\" more religion than science?": [],
    "Should Greta Thunberg take her climate change protest to China? Why or why not?": [
        {
            "author": "Xiao Nengshou",
            "author_bio": "Author has 557 answers and 324.1K answer views3y",
            "text": "Related\nWhy hasn't Greta Thunberg taken her aim at China?\nIs it? ? That's great. We in China escaped a calamity.\nI remember she once proposed to let the Chinese give up the use of chopsticks because of wasting wood. She didn't even know that chopsticks were made of bamboo.\nShe suggested that China should learn to eat from knives and forks in the West, just because steel can be recycled. my God. Doesn't she know how much fossil energy is needed to make steel? Each time the recycled steel is re-forged, fossil energy is used repeatedly, and she doesn't even know how serious the pollution is when manufacturing steel.\nEven making metal tableware. Well, metal chopsticks should be used all over the world, because a set of Western tableware uses several times more metal.\nDo we need to make steel beds, steel houses? Just because steel can be recycled? ?\nI welcome foreign scientists, medical scientists, and astronomers to come to China for exchanges. Of course, I also like western business elites.\nBut children should go to school first, so that they can have basic common sense to think like a normal person. Environmental problems are indeed very serious.\nBut whether we are willing to return to the primitive society, throw away all cars and computers, and replace all the food on the plate with wheat, this is not a task that can be completed in one or two years. Making a show is easy, but life is difficult. Not every country has the ability and technology to carry out Sweden's low-pollution production methods.\n2.8K viewsView upvotes\n50\n7",
            "isRelated": false,
            "isRequested": false,
            "views": "2.8K",
            "upvotes": "50 Upvotes"
        }
    ],
    "Will it be impossible to tackle climate change without reducing animal agriculture?": [
        {
            "author": "Who benefits from claiming that animal agriculture is the primary cause of climate change? — Related",
            "author_bio": "Mark Trexler",
            "text": "Studying public policy since 1980!Author has 181 answers and 157.4K answer views7y\nIt's an interesting question. I've noticed the same uptick in Quora questions along these lines, and there also seems to be more of a Facebook Group focus on this topic, along with soils and biochar being \"the\" or \"a key\" mitigation option.\nClearly agriculture and meat production are very significant contributors to climate change (although the link to other environmental problems from deforesta\nContinue Reading\n7\n1\nTed Redmond\nEnvironmentalist, Social Entrepreneur, Architect,Author has 510 answers and 457.2K answer views7y\nThe oil industry benefits when we focus our efforts on secondary causes instead of THE primary cause- which is the use of fossil fuels.\nDoes the ag industry contribute to greenhouse gas production and climate change? Absolutely and they must continue working to reduce and eliminate their impacts. All industries and human endeavors are responsible to understand and eliminate their environmental impacts. No one has a free ticket.\nBut the core issue is fossil fuels. Stop burning fossil fuels. Ride your bike instead of driving and you can eat your hamburger guilt free.\n351 viewsView upvotesAnswer requested by\nMichael Barnard\n1 of 6 answers\n7\n2\nFred Landis\nInvestigative ReporterAuthor has 13.8K answers and 28.7M answer views7y\nAs far back as the 1960s I read in Scientific American that most air pollution was by ordinary automobile traffic. In China and India it may be factories.\nThe first time I heard the established scientific view challenged was by Ronald Reagan. He would say things like pollution is caused by trees.\nIt is important to understand that in the politics of Right-Wing USA to make a provocative claim that defies science or the obvious facts is a political plus.\nReagan and Trump's supporters grew not despite the outrageous statements but because of.\nIt is a regretable fact that Vegans sometimes make claims\nContinue Reading\n12\n2",
            "isRelated": false,
            "isRequested": true,
            "views": "351",
            "upvotes": "7 Upvotes"
        },
        {
            "author": "What is your take on animal farming being a major cause of global warming and climate change? — Related",
            "author_bio": "Pierre Vigoureux",
            "text": "Author has 21.8K answers and 9.1M answer views7y\nThat the question betrays the bias, and the false assumption.\nThe most 'significant' greenhouse gas, as far as heat retention is concerned, is water vapour. When you look at Earth from space, you see mostly blue ocean, white clouds, white polar ice, and much less of the green and brown land. The white clouds retain heat, because they reflect both infrared and visible light. But water vapour is not the real problem.\nWhat makes methane APPEAR to be more 'significant' to the people who really don't understand the problem is that it is a greenhouse gas, that like carbon dioxide, has a 'significant'\nContinue Reading\n3\n2\nRobert Reiland\nClimate science has been my hobby for over 30 yearsAuthor has 5.6K answers and 10.6M answer views7y\nAnimal agriculture makes significant contributions to climate change, but most of the best information I've found in looking into this indicates that it contributes less than 20% of the total impact, even when all direct and indirect factors are taken into account. IOW if everyone became a vegetarian, we would still have a serious problem with climate change.\nOTOH, it would be difficult to completely solve the climate change problem (not that we can in the next hundred years anyway) without dealing with animal agriculture.\n251 viewsView upvotesAnswer requested by\nCollins Mittochi\n1 of 13 answers\n5\n1\nPascal Morimacil\nWorker, Thinker, WriterAuthor has 4.4K answers and 39.5M answer views2y\nIt’s a question of cycles.\nIf you have some grass that grows, then carbon is sequestered, and then if that grass decomposes, is eaten by an animal, or is burned, the carbon is released again.\nThe grass can then regrow, sometimes in just a couple of weeks, sequestering the carbon, and starting the cycle again.\nNow, if instead of cutting grass, you cut trees that have been growing for thousands of years….\nWell, it then takes thousands of years for that cycle to get back to its previous state, where the carbon is once again sequestered in the trees.\nOver millions of years, carbon also ends up bein\nContinue Reading\n\n\n53\n5\n8",
            "isRelated": false,
            "isRequested": true,
            "views": "251",
            "upvotes": "5 Upvotes"
        },
        {
            "author": "How can regenerative agriculture mitigate climate change? — Related",
            "author_bio": "Greg Freemyer",
            "text": "A self described Luke Warmer that has been studying climate science since 2008Author has 3.2K answers and 6.2M answer viewsUpdated 4y\nGod/nature/evolution/random chance gave the world one of it's greatest gifts about the time plants moved from the oceans to the land many, many hundreds of millions of years ago:\nArbuscular mycorrhizal fungi (AMF)\nAMF is absolutely amazing in what it does to bring nutrients to plants and simultaneously build up soil carbon. Have you ever seen dark rich natural soil? I don't mean soil that comes out of a bag or compost heap, but the real deal? Probably not, few of us have. But there are some pristine soils in Japan and Hawaii with 10% SOM (soil organic matter). The US heartland was 7% SOM when bu\nContinue Reading\n7\n1\n6\nMandi Smallhorne\nFreelance journalist and science writerAuthor has 285 answers and 324.8K answer views4y\nThis is one of the great solutions (see #ProjectDrawdown). Regenerative farmers are really farming the soil. Soil is one of the four essentials (air, water and biodiversity are the others) for life. A rich layer of topsoil, full of bacteria and insects and fungi and earthworms, fed by manure and decomposing bodies (anything from birds to rodents to us) does far more than grow crops and pastures. It is also a great sequester of carbon: “Potential C sequestration in agricultural soils is estimated to total 600 and 900 megatons per year over several decades.” (That’s according to Daniel Hillel and Cynthia Rosenzweig of Columbia University.)\nBut conventional farming won’t do that job - you have to have the least amount of disturbance of the soil (no-till), with cover crops to shield the soil from drying up (and blowing away). This also makes the soil more porous, less prone to compaction: more water is likely to be retained and seep through into the water table. Healthy topsoil with cover plants on it is also resilient in floods - it tends to slow down and soak up water running across it. There’s more, much more - farming for healthy soil is definitely a huge win!\n98 viewsView upvotes\n1 of 3 answers\n1\n3\nAgrikulture Today\nAgrikulture Today is committed to addressing various environAuthor has 70 answers and 25.9K answer views1y\nMost farms in America are losing 5.8 tonnes of soil per year while enduring massive losses due to drought and flooding, as well as increasing by 4% the amount of the financial burden each year. In collaboration with nature to restore the soil’s organic matter as well as biodiversity through regenerative agriculture, human beings can not just aid in the reversal of the adverse effects on climate; they can monitor the health and the equity of whole ecosystems, which includes humans at an inter-relational, physical as well as a fiscal scale.\nWhile practiced for several millennia, regenerative agri\nContinue Reading",
            "isRelated": false,
            "isRequested": false,
            "views": "98",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Is the animal agriculture industry obstructing efforts to curb climate change? — Related",
            "author_bio": "John Goudge",
            "text": "BS in Geography & Climatology, University of Wisconsin - Madison (Graduated 1967)Author has 522 answers and 89.6K answer viewsMar 28\nfor the most part yes. Both the meat and dairy segments are not integrated parts of industrial agriculture an economically and environmentally unsustainable system kept afloat by massive government subsidies. It produces food stuffs that need heavy processing to be digestible for humans. That is the keystone of the American diet which is very good at producing obesity, diabetes and cardiovascular disease. It\nIt specializes in Confined Animal Feeding Operations. At its most developed form — Chickens. The packing owns the animals including the breeding stock. The predominate breed is the Cornish Cross — a terminal cross of two breeds. This bird lacks the capacity to feel satiated. Thus it is always hungry. As a result it grows at prodigious rate, causing many heart attacks and leg fractures. The birds are slaughtered at about 49 days. The only times they see the daylight is when being transported from the hatchery and when being taken for slaughter by the packing companies They are feed a mix prepared at the packing companies mills at the direction of the packing company which picks up the\n54 viewsView upvotes\n1 of 11 answers\n2\nBarry Weir\nAn empiricist from Lima, PeruAuthor has 18.8K answers and 13.6M answer viewsMar 30\nOriginal question: Is the animal agriculture industry obstructing efforts to curb climate change?\nNo.\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "54",
            "upvotes": ""
        }
    ],
    "As a vegetarian or vegan, you wouldn't complain about a dog or cat that eats meat, so why complain about people who eat meat? Isn’t a human a worthy animal to eat what they need to eat to make them fully healthy?": [
        {
            "author": "Michael Tuttle",
            "author_bio": "Author has 3.9K answers and 1.6M answer views3y",
            "text": "Related\nWhy do you think vegans are frowned upon by many people who usually eat meat?\nIn my exposure, people tend to dislike vegans because too many of them are preachy, judgmental and very demanding that their oftentimes faddish and fleeting dietary preferences be accommodated to the point that separate meals must be prepared in order to avoid a scene. Teenage children in particular are prone to this, but not solely. Try having a family dinner with a vegan on the invite list. Not vegetarian, mind you, but full-on vegan. It doubles the work and seldom is really all that appreciated. The impression people get is that veganism is more about look at me, I’m so morally superior than it is about health concerns. So, it can often seem frowned upon due to the behavior of many vegans. If someone wants or needs to have a strictly plant-based diet I have no problem with that, but leave the attitude behind. It doesn’t have the desired effect at all, in fact it’s the opposite.\n2.1K viewsView upvotes\n1 of 13 answers\n30\n14",
            "isRelated": false,
            "isRequested": false,
            "views": "2.1K",
            "upvotes": "30 Upvotes"
        },
        {
            "author": "John Galvin",
            "author_bio": "1y",
            "text": "Related\nWhat do vegan dogs need?\nA new owner\n30.3K viewsView upvotesView 5 shares\n1 of 122 answers\n2.6K\n5\n113",
            "isRelated": false,
            "isRequested": false,
            "views": "30.3K",
            "upvotes": "2,676 Upvotes"
        }
    ],
    "Is Tulsi Gabbard a vegetarian?": [
        {
            "author": "Joel Vanklompenberg",
            "author_bio": "Former Retired 2y",
            "text": "Related\nIs Tulsi Gabbard a progressive?\nI don’t think you can classify Tulsi as a progressive a conservative a liberal or even a moderate or a centrist. I think she is a person who has her own views on issues and will not toe any party line.\n392 viewsView upvotes\n1 of 5 answers\nYour response is private\nWas this worth your time?\nThis helps us sort answers on the page.\nAbsolutely not\nDefinitely yes\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "392",
            "upvotes": "1 Upvote"
        }
    ],
    "What is a good thesis statement for climate change?": [],
    "If every human being on Earth turns vegetarian/vegan, won't it create a problem in the food chain?": [],
    "Are cows really the primary cause of global warming?": [
        {
            "author": "Yoel Krupnik",
            "author_bio": "ReaderAuthor has 3.4K answers and 465.8K answer views2y",
            "text": "Related\nAre cows causing global warming?\nCows release methane (CH4) which is known for its greenhouse effect. There are other natural sources of methane as well. BTW, most living organisms which breath oxygen release CO2 to the atmosphere, even plants, although plants do absorb more CO2 then hey release. Methane has much stronger greenhouse effect then CO2, and overall all biosphere release more CO2 then all human activity.\nBut there are few points worth mentioning. Methane is broken fast in the atmosphere in a chemical process and due to solar radiation, so it does not accumulate too much.\nCarbon-dioxide on the other hand can accumulate, because it takes long time before it is removed from atmosphere. The biosphere itself is (or was?) balanced in terms of the amount of CO2 that is generated vs. the amount which is absorbed. If man made CO2 is added it would take some time for the biosphere to adapt for it, and in the meanwhile the amount of atmospheric CO2 increases. It is actually measured and observed phenomena.\n95 viewsView upvotes\n3\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "95",
            "upvotes": "3 Upvotes"
        }
    ],
    "What vegan foods harm animals indirectly?": [
        {
            "author": "Anonymous",
            "author_bio": "6y",
            "text": "I will try to answer the question by addressing the opposite: What vegan foods do not harm animals indirectly?\nHuman-consumed vegan foods don’t technically have to be harmful, directly or indirectly, to any animal. Foraging, if you know what you’re doing, is a good start. It helps if you live somewhere where the native flora are able to provide good nutrition, including vitamin B12 from unwashed fruit/veg or an environmentally-sound supplement manufacturer.\nWhat about kitchen gardens? Copper strips repel above-ground slugs but cause them a bit of harm (reversible). Use netting to ward against foraging animals. Although considered environmentally friendly, even use of natural predators such as nematodes and ladybirds are harmful to animals, but you can grow plenty of things, in sufficient quantity, without requiring natural predators or harmful repellents. If you’re careful and do thorough research you can survive off a kitchen garden and foraging without harming animals.\nBe careful with things like rhubarb. The leaves are terribly toxic but if you plant them in reach of a rabbits you may get some nibbling at the leaves. I don’t know if in my case the rabbits survived, but I am sure that some harm was caused.\nIf you are buying any vegan food from a supermarket they are most likely to be causing animals indirect harm.\nAmongst the worst are soy- and palm-derived products. By purchasing items containing soy or palm (with few exceptions) you are technically contributing to their value/demand and directly raising the incentive to do further irreversible damage to the most valuable natural habitats - rainforests and mangroves respectively. Vegans tend to use lecithin to supplement for choline, which unfortunately is most commonly and affordably found as a soy-derived, as opposed to sunflower-derived, product.\nHarms animals.\nIntensive farming methods; monocultures, pesticides, landscape management, water management.\nHarms animals.\nOrganic food generally uses animal blood and bones as fertilisers.\nHarms animals.\nWhy? That stuff isn’t provided for free, and comes from farmed animals. Anything that increases their value, even if it is from end of life dairy cows, increases the incentive to have more animals being raised, or not reduce the number raised. The market is not economically perfect, but as a vegan, it certainly helps to be aware that the potential for animal harm certainly exists and not get caught out on that point when discussing this with non-vegans and the anti-organic crowd. How does organic vs non-organic compare in terms of environmental/animal harm? It’s a difficult question and it depends on a case-by-case basis (not even crop-by-crop).\nTransport of food by vehicles.\nHarms animals.\nNot just in terms of carbon emissions, or even the resources used in manufacturing or maintaining transport facilities, but also the insects that get crushed when these things operate.\nArtificially heated/lit greenhouses (esp. those with carbon-based fuel).\nHarms animals.\nBasically anything that leads to increased pollution (light, chemical or otherwise) or greenhouse gases indirectly causes animals harm. Anything that causes environmental change or damage will almost always harm animals. This includes farming practices which promote soil nutrient depletion. And what about the people employed at the shop or involved in the production or transport of food which may otherwise be animal-harm-free? If they eat or do things that harm animals, then perhaps you are also facilitating or incentivising that harm?\nIt is an interesting question, but beyond growing or foraging the food yourself, I think it’s safe to assume any other food has caused indirect harm to an animal. Accurately quantifying harm, not that this was asked, is almost impossible, and arguably, with all due respect, not too valuable an exercise.\n3K viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "3K",
            "upvotes": "22 Upvotes"
        },
        {
            "author": "Manish Jain",
            "author_bio": "Lives in EnglandUpdated Sep 5",
            "text": "what kind of absolute answer every one is giving here. It is impossible to not to kill any animal even for one moment. When you breath you kill bacteria in the air. when you walk you kill bacteria or small ants in the ground. when you clap, you kill bacteria in you hand and air!\nIt is all down to your intention. You can only minimise the harm by becoming vegetarian or a vegan.\nSome Jain sadhus cover their mouth and use a broom before waling on the ground.the objective is to minimise the killing of any kind of living beings.\nYour intent is as important as your actions.\n579 viewsView upvotes\nYour response is private\nWas this worth your time?\nThis helps us sort answers on the page.\nAbsolutely not\nDefinitely yes",
            "isRelated": false,
            "isRequested": false,
            "views": "579",
            "upvotes": "5 Upvotes"
        },
        {
            "author": "Kai Simovich",
            "author_bio": "Line Cook (2015–present)6y",
            "text": "To live is to kill. To die is to give life.\nIt’s not that anything (including vegan food) indirectly hurts animals more than anything else. We probably accidentally kill just as many bugs on our commutes to work as an organic farmer kills with neem oil. Our houses are built on a plot that has stolen the potential space for a bevy of animals, who in turn stole the space of others or died.\nWhen we die and our bodies decompose, we become host to millions upon millions of new creatures. Knowing that you will facilitate so much life hopefully makes up for any guilt you would feel for accidentally killing.\nAside: Cremation and donation to medical institutes have their own merits. Don’t want to knock anyone else on their funeral choices.\n321 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "321",
            "upvotes": "4 Upvotes"
        },
        {
            "author": "Fred McGillicudy",
            "author_bio": "As a bipedal mammal I eat nearly every day!6y",
            "text": "In the area I live deer and pigs are highly destructive to food crops. A few deer can go through several acres of soybeans in an evening. Pigs are even worse. Left unchecked they can bankrupt a farmer. So, DNR issues “crop damage permits” to the farmers. These permits allow the farmer to go into their fields after dark, turn on their lights and shoot as many deer as they can. And do it night after night. The farmers do not want all those dead deer laying around in their crops so they do not shoot to kill but rather to wound so the deer will leave the fields and die in the woods later.\nJust another little known aspect of the food we eat.\n530 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "530",
            "upvotes": "4 Upvotes"
        },
        {
            "author": "Lukas Pfleger",
            "author_bio": "6y",
            "text": "From the moment that humans began to raise cattle and adopt agriculture we generated an impact. There is no animal species whose survival doesn’t result in the death of other animals, whether directly or indirectly. I understand that this can be a painful realization. I’d also like to live in an ideal world, but that’s not the reality. Many vegans and people who only wear cotton seem to believe they don’t cause any deaths, but they do.\nThe first impact of mass cultivation is deforestation: we force nature out to make room for crops.\nIf you eat meat, you kill animals, but you also kill them by eating plants. A lot of people who care about environmental issues look for good guys and bad guys, but it’s not like that: it’s far more complicated.\n495 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "495",
            "upvotes": "13 Upvotes"
        },
        {
            "author": "Olga Radzikh",
            "author_bio": "Animal loverAuthor has 177 answers and 359.8K answer viewsUpdated 5y",
            "text": "Originally Answered: Is there any vegan foods that indirectly harm animals?\nYes. Palm oil is a good example. Unsustainable palm oil production is a major cause of deforestation in Southeast Asia. Orangutans are severely affected by palm oil plantations. Many of them are killed by farmers and die because of habitat loss. Palm oil can be produced in a sustainable way, but it is good practice to avoid foods that include it, especially if you are unsure of its origin.\nAs already written in other responses, a lot of animals that are considered pests are culled to preserve the plant harvest. However, considering that a significant proportion of world’s crops are fed to farmed animals, non-vegan lifestyle still harms many, many more animals than a vegan one. Plus, wild animals are also culled for animal farming. Killing wolves to preserve livestock is a common example.\nBeing vegan is not about being perfect. It is about harm reduction. We may be unable to avoid every single product made with animal ingredients, same as it is difficult to completely eliminate products of human exploitation, or things that are environmentally destructive. But most animal-derived products can be avoided or replaced, so if we can avoid harm, why would’t we?\n1.6K viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "1.6K",
            "upvotes": "23 Upvotes"
        },
        {
            "author": "The Vegan Joint",
            "author_bio": "Owner at The Vegan Joints (2006–present)Jul 19",
            "text": "When adopting a vegan lifestyle, one typically aims to reduce direct harm to animals by avoiding products derived from them. However, it's essential to be aware that certain vegan foods may indirectly contribute to animal harm. Understanding these factors can help make more informed choices as conscientious consumers.\nPalm Oil Products: Many vegan foods contain palm oil, which has led to significant deforestation and habitat destruction in regions like Southeast Asia. This deforestation has adverse effects on wildlife, including endangered species like orangutans, tigers, and rhinos. As responsible vegans, we can choose products that use sustainably sourced palm oil or opt for alternatives altogether.\nSoy and Crop Farming: The mass production of soy and other crops used in vegan products can lead to land clearing and displacement of wildlife. Additionally, the use of pesticides and fertilizers can harm local ecosystems, impacting animals like insects, birds, and small mammals.\nQuinoa Production: The increasing demand for quinoa, a popular vegan protein source, has resulted in higher prices for local communities in South America. This has led to a shift in agricultural practices and a reduction in traditional animal husbandry, affecting llamas, alpacas, and other livestock.\nMonoculture Farming: Some large-scale vegan food production relies on monoculture farming practices, where vast areas of land are dedicated to a single crop. This practice can disrupt local ecosystems, reduce biodiversity, and negatively impact animals dependent on diverse habitats.\nTransportation and Packaging: While not directly related to the food itself, the transportation and packaging of vegan products can contribute to pollution and harm wildlife. Choosing locally sourced and minimally packaged items can help mitigate this impact.\nRegarding vegan food options in Los Angeles, \"The Vegan Joint\" stands out as an excellent choice for conscious eaters. With its commitment to plant-based cuisine and a wide array of delicious vegan offerings, \"The Vegan Joint\" provides a satisfying dining experience that minimizes direct and indirect harm to animals and the environment.\nIn conclusion, as we strive to reduce animal harm through our dietary choices, it's essential to be aware of the indirect effects certain vegan foods can have on animals and the environment. By opting for ethically sourced and sustainable options, like those offered by \"The Vegan Joint,\" we can foster positive change and support a more compassionate food system.\n31 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "31",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Preman Tilson",
            "author_bio": "Lives in Wellington, New ZealandAuthor has 18K answers and 14.9M answer views5y",
            "text": "Most all food production, indeed all activities of life, involve some harm. We step on insects while walking, etc. That's why Jain monks wear breathing masks (to avoid inhaling any insects) and have an assistant to sweep the ground free of any bugs when they walk (which seems utterly hypocritical, since nobody is sweeping the ground in front of the assistant - it's clearly not about reducing harm but avoiding bad karma for the monk).\nBut for most vegans, the idea is to reduce harm, not eliminate it.\nFurther, there is inevitably a scale of harm. Humans are at the top - we simply do not eat humans, no matter how yummy and delicious. Plants are at the bottom - they are the least sentient, so since we need to eat something, it's perfectly okay to eat plants. (Although am I the only person who thinks that after living for hundreds of years, something like a giant sequoia might not have a level of sentience of its own and should be accorded a certain amount of respect?)\nAnimals vary greatly in sentience. Most people are instinctively repelled by the idea of eating great apes and cetaceans, the two classes of animal that seem as sentient as us. We also tend to feel it is wrong to eat endangered animals (which would now include most large non-domesticated mammals).\nMost of us don't eat dogs and cats because as our pets, we are aware of their sentience - their intelligence and ability to feel and love.\nThe only thing stopping us treating our domestic livestock with the same respect is a willful refusal to acknowledge their sentience, because we love the way they taste and would just rather not give them up. But if you personally get to know a cow, sheep, pig or chicken, they are really no different from our pets - some are possibly more intelligent.\nThis is true of many fish and birds as well. If you keep these as pets, you know how smart they are, and capable of relationships. Actually, some birds are more intelligent than primates in some ways.\nGetting down to rodents, insects, worms, etc (the most numerous victims of agriculture), they seem far less sentient. I'm not saying we should just slaughter them for the fun of it, but who can't see that if you have to inadvertently kill some creature in order eat, it's better to kill some worms and beetles than a polar bear or an elephant?\n195 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "195",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Jan Soloven",
            "author_bio": "Trained chef, organic gardener, and experienced eater.Author has 4.6K answers and 39.9M answer views6y",
            "text": "All of them.\nThis is what a cabbage looks like if you grow it in real dirt in a real garden and you are kind to all the little bugs that want to eat it.\nBut this is what the organic cabbage looks like at Whole Foods:\nIn order for your vegetables to look like this, you must kill the little animals, be they bugs, moles or bunnies, that would eat your produce. You might do it with pesticides, whether artificial or natural pesticides such as Neem. You can let your cat out to kill moles, or you can grow crops in a greenhouse, but even then, you deprive bugs and other creatures of their lives by withholding food from them. Every bite of a vegetable you take is at the expense of other creatures that could have and would have eaten that bite. That’s the nature of life, there’s no such thing as food without a loss of life. All human food comes from living things, and all food that we eat comes at the expense of other creatures. I’m perfectly comfortable with that.\n207K viewsView upvotesView 5 shares",
            "isRelated": false,
            "isRequested": false,
            "views": "207K",
            "upvotes": "3,913 Upvotes"
        },
        {
            "author": "Wayne Roberts",
            "author_bio": "Expert on food & cities & food securityAuthor has 483 answers and 643.6K answer viewsUpdated 5y",
            "text": "This is a bit of a loaded question that gets at the pitfalls of the way many of us think about food issues.\nWe all tend to think of individual food preferences in terms of complete ideologies, which is why vegetarianism and veganism are isms, when they’re really just personal choices and preferences people make for personal reasons. They are not really and should not be judged as complete analyses or some form of Theory of Everything.\nUnfortunately, neither humans nor other animals can function without negatively impacting on other species or things. To grow veggies, we have to take land out of wilderness and manage it to exclude many insects and other animals that would eat the food we grow. Even if we only forage for food, we are usually taking materials other species would like to have.\nThis is how nature works, why evolution happens. It is the way of the world.\nHumans have a rare ability to produce food and manage the way they produce food to minimize harm to other people and creatures, and to maintain balance in ecosystems. That is what sustainable diets are about.\nBut we can't manage in ways that eliminate all damage to all creatures and things because we can't eat without manipulating environments in some way with tools. Tools substitute for our lack of claws, speed, wings and so on, and we wouldn't survive without them. Tools allow us to manipulate environments.\nVeganism is one way to reduce unnecessarily negative impacts. Organic is another way. Fair trade is another way. We should explore them all. We should be self righteous about none of them. We should be humble with our responsibility and graceful with our power.\n2K viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "2K",
            "upvotes": "32 Upvotes"
        },
        {
            "author": "Louis Walker",
            "author_bio": "Vegan. Realist. Bit of a slackerAuthor has 221 answers and 818.7K answer viewsUpdated 6y",
            "text": "Originally Answered: Is there any vegan foods that indirectly harm animals?\nSo as to be expected the anti-vegan lobby are relishing answering this question again. Obviously all sorts of animals are harmed or killed everyday by vegans and non-vegans alike. All plant production on a commercial scale requires some form of pest control or fertilisation. There are farmers trying to use methods that have as little impact on animals as possible such as farmers using veganic farming methods but even that normally requires burning of feeder crops like clover on occasion and many insects would die in the process. No vegan claims death is not involved in the production of their food. Their food doesn't however involve the wholesale slaughter of animals just to please their palate.\nWhy do anti-vegans love this question? Well the reasoning goes like this : “Animals are killed by vegans; they just don't know it(subtext : stupid vegans : they should eat meat; it will feed their brains). They spend all this time avoiding meat, milk,eggs and shunning animal derived clothing yet each plate of greens they eat has resulted in many deaths. Small rodents are killed in the harvesting process and millions of insects are killed to grow their crops. So stupid. I mean isn't that hypocritical? I’m so glad I'm an omnivore. They may as well eat meat like the rest of us; life involves death anyway, just one of those things. Oh shame, bunny huggers hey? Oh well, it takes all sorts”.\nSo this is a case of if you can't do everything you may as well do nothing.\nVeganism results in less suffering; no one claims it results in no suffering.\nAlso look to the answer comparing standard plant production against pasture raised animals. So we must now compare the vegan option that causes most deaths to the farming method that ostensibly causes least deaths. How convenient. How many animals are actually pasture raised? In the United States 99% of all animals are factory farmed. Worldwide the % sits at 70%.\nThere simply isn't enough land in the world to raise pasture fed animals to meet human demand and with a growing human population the demand for land for human development means those pastures will be getting smaller and smaller.\nPalm oil results in deforestation. But do only vegans eat palm oil? No. Yet this is also often thrown in vegans faces to showcase their hypocrisy. Many vegans also avoid palm oil; it doesn't make you a non-vegan if you don't.\nBottom line : it's a tired argument riddled with logical fallacies. Vegan food production like all food production results in death to some creatures, vegans just try contribute to minimising the suffering and unnecessary death of sentient creatures to the extent practicable.\n4.1K viewsView upvotesView 8 shares",
            "isRelated": false,
            "isRequested": false,
            "views": "4.1K",
            "upvotes": "107 Upvotes"
        },
        {
            "author": "James Lacey",
            "author_bio": "researcher and writerAuthor has 25.1K answers and 17.9M answer views6y",
            "text": "Originally Answered: Is there any vegan foods that indirectly harm animals?\nIs there any vegan foods that indirectly harm animals?\nAgriculture in modern economies involves eradicating or destroying insects and other species that feed on crops; creating farmland means removing habitat for the use of whatever species may have lived in that area.\nTo put the issue in a large context, as with many things, we can’t cynically turn away from incremental improvements because they fail to deliver some theoretical level of perfection.\n782 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "782",
            "upvotes": "6 Upvotes"
        },
        {
            "author": "Mike Current",
            "author_bio": "Sometimes I write things. Sometimes I get paid for it.6y",
            "text": "A vegan will not eat honey because it is an animal byproduct produced by bees.\nA vegan will eat foods which have been pollinated by bees.\nList of crop plants pollinated by bees - Wikipedia\nDiscuss.\n553 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "553",
            "upvotes": "7 Upvotes"
        },
        {
            "author": "John B.",
            "author_bio": "Studied at University of California, Berkeley (Graduated 2012)Author has 195 answers and 559.5K answer viewsUpdated 3y",
            "text": "A vegan lifestyle reduces harm to animals both directly and indirectly. Nobody ever said a vegan lifestyle/diet is perfect but it does reduce animal suffering, captivity, death and environmental harms. A vegan diet revolves around reduction of animal and environmental harm. Many answers actively seek to make vegan diet something negative when studies and research show that it’s highly positive.\n“They have shown that reductions in meat consumption and other dietary changes would ease pressure on land use (11, 12) and reduce GHG emissions (7, 11–14).” (Pnas)\n“A major report on land use and climate change says the West's high consumption of meat and dairy produce is fueling global warming.” (BBC, Harrabin).\n“Livestock rearing contributes to global warming through the methane gas the animals produce, but also via deforestation to expand pastures..” (BBC, Harrabin).\nYou have to also understand that meat consumption is increasing due to overpopulation. The demand for pasture raised/grass fed animals is not realistic for the world. Not only does it increase global warming (which causes harm to many animals by destroying their homes) but it’s just not sustainable.\nAnother huge problem is that grass fed beef leads in deforestation.\n“Raising grass-fed cows also leads to deforestation – another big climate change issue – as farmers chop down forests in order to expand their pastures.”\n“Grass fed” does not mean that it was totally grass fed. Many of the wheat/corn crops actually go to these animals, to make them big enough to kill. Farmers don’t have the resources to raise purely pasture raised animals. Hence the increase in factory farming.\n“Almost 50 percent of the grains produced in the world are fed to livestock, yet there remain about 800 million people suffering from hunger and malnutrition mostly in the developing countries.” (fao)\nFactory farming is just unacceptable. Most of the meat/eggs/dairy that people consume come from factory farming. If you just spend one day there, you will come to see why so many people turn to vegan lifestyles. Not only are these animals slaughtered, they are also tortured.\nAnother issue is that many companies want to sell their products without making consumers feel guilty. What they do is label their eggs “free range” even though that basically means nothing. Just because the chickens were free range does not mean they were not tortured or in pain.\nSources:\nYour grass-fed burger is making climate change worse\nhttps://www.pnas.org/content/pnas/113/15/4146.full.pdf\nPlant-based diet can fight climate change - UN\nHarvard Study Finds Shift to Grass-Fed Beef Would Require 30% More Cattle and Increase Beef's Methane Emissions 43%\nLivestock - a driving force for food security and sustainable development\nhttps://iopscience.iop.org/article/10.1088/1748-9326/aad401/pdf\nhttps://www.animalsaustralia.org/features/lets-talk-about-climate-change.php\n1.9K viewsView upvotesView 2 shares",
            "isRelated": false,
            "isRequested": false,
            "views": "1.9K",
            "upvotes": "52 Upvotes"
        },
        {
            "author": "Enric Martinez",
            "author_bio": "Vegetarian since 1994 and vegan since 2013.Author has 10K answers and 7.7M answer views6y",
            "text": "Originally Answered: Is there any vegan foods that indirectly harm animals?\nAny food can potentially harm animals, indirectly or not.\nThe harvesting of crops may harm animals, but in any case, the vast majority of crops are meant for feeding livestock, this means something like 3/4 of maize, the same amount of any other grain crops and a staggering 90% of soy.\nIt is also utterly wrong to think that veganism is just some stupid religious trying to attain a philosophical absolute, in this case “not kill animals”. Veganism is a political movement and our aim is to reduce animal abuse as far as we can, and most of us are smart enough to know what reality means. Thinking otherwise is stupid.\n182 viewsView upvotesAnswer requested by\nWilliam Mcbride",
            "isRelated": false,
            "isRequested": true,
            "views": "182",
            "upvotes": "4 Upvotes"
        },
        {
            "author": "Charles F. Morissette",
            "author_bio": "Author has 896 answers and 1.1M answer views6y",
            "text": "There’s no vegan food that will, or vegan who wants to, hurt absolutely 0 animals unless that vegan hasn’t thought anything through.\nWe need to use pesticides to keep produce growing properly.\nWhen we harvest wheat fields, the life that needed that wheat tends to perish.\nIf worms invaded my body, I’d go to a doctor to get them out.\nIf termites invaded my home, I’d gas bomb them.\nAll of those are “directly”, but that also depends on your definition of directly.\nThe different is a few factors:\n1: The killing of animals isn’t the purpose of these activities. Here, it is the difference between purposefully ramming people down in France with a truck, vs accidentally ramming another car with a truck. We consider accidents a byproduct of driving, not a direct result of it. When we use pesticides, the purpose of it is to keep our lettuce safe, not to murder bugs. When we harvest wheat, it is to eat it, not to starve mice, etc.\n2: The scope. Most, not all, but most animals raised fall into either 1 of 2 categories - grain fed (vast majority where I live), or from hacked and slashed land (e.g. cattle farming in the Amazon).\nIn the case of the first, cattle take in roughly 12x the food they produce, so whatever argument is used is multiplied by 12x + 1 (the cow being the +1).\nIn the latter, you are actively destroying large areas of natural land for a very inefficient food system (meat).\nAs you can see from both of those things - human life directly causes harm to animals, veganism minimizes it.\n1.1K viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "1.1K",
            "upvotes": "14 Upvotes"
        },
        {
            "author": "Mike Puorro",
            "author_bio": "Former EducatorAuthor has 6.3K answers and 6.1M answer viewsUpdated 1y",
            "text": "Some animals perpetuate their species by being on the top of the food chain. Some animals perpetuate their species by reproducing quickly and in large numbers. What do the cow, the potato, and the apple have in common?\nWe eat them of course. Apple trees no longer have to compete with other trees, potatoes no longer have to struggle with weeds and pests, and if everyone suddenly went vegan, there would be millions of cows in the streets starving to death.\nKind of like in India now: Yay vegetarianism!\n1.3K viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "1.3K",
            "upvotes": "17 Upvotes"
        },
        {
            "author": "Katie Bjorkman",
            "author_bio": "I like to cook and have taught myself a great deal over the yearsAuthor has 14.4K answers and 27.9M answer views6y",
            "text": "Originally Answered: Is there any vegan foods that indirectly harm animals?\nYes.\nAll of them.\nAll plant foods are grown in soil, which means that forests or natural prairies were cleared and animals killed to make the fields or orchards.\nThen the farmer (or the government or whoever) had to shoot or trap or poison thousands or millions of animals (if we are counting little animals like mice and insects, certainly thousands) to keep them from eating all of the crops.\nThen when the crops were harvested, animals were caught up in harvesting equipment and crushed or chopped to death.\nThen the crops were transported and animals died due to the vehicles on the road - and the construction of the roads, of course.\nWhen the crops were stored, a lot of rodents and insects were killed to keep it sanitary and to keep them from eating all of the crops.\nThen transported again…\nAnd so on.\nWe are omnivores living in a complex web with other species. Survival in that web necessitates the death - direct or indirect - of other things in that web. Such is life.\n284 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "284",
            "upvotes": "4 Upvotes"
        },
        {
            "author": "Kedar Kamat",
            "author_bio": "Passionate about physics, spirituality and computersAuthor has 60 answers and 148.9K answer views6y",
            "text": "I find many answers here wrong and misleading. Vegan food in US grown with animal fertilizers and pesticides may be harmful, but that's nothing to do with vegan food. As the same grown in India with simple ancient techniques is harmless.\nThe answers here are misleading as they are talking about wrong organic farming techniques used in the US. The Indian technology is to use natural materials like cow dung and urine in combination with shredded vegetable matter to create fertilizers. When we avoid urea (which is sweet in smell and attracts bugs) we prevent insect infections.\nThere is however harm done to plants themselves in certain cases. If we include the plants as well and decide not to harm them in the process then there are cases to consider.\nAny lentils or grass grown seeds like rice is grown by killing the plant after harvesting.\nA banana plant grows bananas only once and is killed as it becomes useless to us after harvesting.\nAny underground food item like potatoes, carrots, groundnuts, onions are harvested by uprooting the plant and killing it.\nSome spices like coriander leaves, mint leaves are harvested by uprooting the entire shrub.\nMany fruit trees are pruned to increase production.\nThere are religions like Jainism that avoid food items that harm the plants. But today implementing this stringently is impossible.\nAs a general rule in karma, the more evolved a being is, the less we should harm. This can be summerized as per priority :\nSaints or godlike men\nHumans\nAnimals\nInsects\nPlants\nInanimate\nBeing vegan is a good intent but harm can be done at various levels. And harm done to humans invites more suffering to you than animals. A vegan who harms people may be worse than one who slaughters animals.\n812 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "812",
            "upvotes": "6 Upvotes"
        },
        {
            "author": "Donna Fernstrom",
            "author_bio": "Reptile keeper and breeder, wildlife observation and ecology hobbyist.Author has 9.7K answers and 85.2M answer views6y",
            "text": "Originally Answered: Is there any vegan foods that indirectly harm animals?\nWell… all of them do. Every single one.\nThe Earth’s ecosystem is a fluctuating ball of eat and be eaten. If you want to raise anything, or even just EXIST, you’re harming animals. Every time you take a shower, or wash your clothes, stand up or sit down, you harm animals. Granted, many of them are very small, but they’re animals.\nRaising crops outdoors requires some sort of pest control - even certified organic crops are sprayed with pesticides, some as toxic as rotenone. You can use biological pest control - putting in some animals to eat others - but it’s still you who is responsible for that happening. Indoors, well, the greenhouse had to be built out of something, and the manufacturing process, without a doubt, harmed animals. Water purification and treatment harms animals.\nIn a lot of cases, conventionally produced vegan foods harm far, far more animals than if you just ate locally-raised, pastured animals. And hunting for wild game with non-lead shot results in some of the fewest animals death...\nAccess this answer and support the author as a Quora+ subscriber\nAccess all answers reserved by\nDonna Fernstrom\nfor Quora+ subscribers\nAccess exclusive answers from thousands more participating creators in Quora+\nBrowse ad‑free and support creators\nStart free trial\nLearn more\n5K viewsView upvotesAnswer requested by\nWilliam Mcbride",
            "isRelated": false,
            "isRequested": true,
            "views": "5K",
            "upvotes": "86 Upvotes"
        },
        {
            "author": "Scott Soloway",
            "author_bio": "I have probably eaten a lot more food than you.Author has 5.5K answers and 7.8M answer views6y",
            "text": "Let’s posit that vegan food becomes so good and so inexpensive that the consumption of non vegan foods becomes vanishingly small. Farmers and ranchers will not be able to afford to tend to their millions of chickens, cows and pigs. They will have to either abandon them so that many of them will die from dehydration, starvation or predation, or they will have to kill them all quickly- young, old, pregnant, nursing etc.\nThis is certainly harming them, but some may say it is better than raising them to be slaughtered, milked or used as egg prodicing machines.\n407 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "407",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Calin Antonescu",
            "author_bio": "Studied at Naval Academy, Constanta, RomaniaAuthor has 3.4K answers and 4.6M answer views6y",
            "text": "We eat (regardless of what kind of food), we produce methane gas, the same way as let’s say cows and that is way more powerful as a greenhouse gas than CO2.\nOur emissions harm the environment, hence the animals. The more vegan food we eat, the more human methane emissions (but less animal emissions as the meat consumption reduces).\nThe only way not to harm anyone would be not to exist. :)\nLet’s move out from the planet!\n185 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "185",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Lucian Coatu",
            "author_bio": "Studied at Facultatea De Automatica Si Calculatoare Iasi6y",
            "text": "All vegan foods harm animals.\nAll animals eaten by non vegans eat vegan foods or other animals that eat vegan foods.\nIt’s just that eating vegan foods is more efficient in ‘non harming animals’ as 1 calorie of meat was necessarily produced by consuming >1 calorie of vegan food. So eating the vegan food directly results in less harm than eating animals. It really is simple math.\n388 viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "388",
            "upvotes": "1 Upvote"
        },
        {
            "author": "Austin Jaganshi Donnelly",
            "author_bio": "Studied Environmental Science (college major) at Quinnebaug Valley Community College (Graduated 2016)Author has 61 answers and 208.9K answer views6y",
            "text": "As others have said: All of them.\nWe have this thing called the circle of life. Bugs pollinate plants, herbivores eat plants, carnivores eat herbivores, all of them die and fertilize the earth to grow more plants, etc. etc. Veganism hurts this cycle. Even being Vegetarian hurts this cycle.\nThe human race has drastically altered this cycle on its own. We have wiped out countless species of predators and herbivores both on our path to development and expansion. Habitats destroyed, species gone extinct. Now we like to put any dangerous predators in zoos or preserves where they can’t hurt us, and are fun to look at. At the same time, we mass produce herbivores every single day to make our food.\nIf vegans/vegetarians had their way, none of these herbivores would be killed. They would be released into the wild free of human “cruelty.” And then starts the cycle of death, instead. These herbivores are already overpopulated because we grow them for food. Because we’ve taken most, if not all of their predators away, their herds will continue to grow exponentially, unchecked. Now, if you’re vegan, that probably means you don’t want hunters to kill them for sport or food. So there’s basically nothing to stop their numbers from growing, and growing, until.. Starvation. The herds have grown so large that they have consumed all of the vegetation in the area and basically rendered it barren. Disease will set in as they grow weak, and they will all die slowly of either hunger or sickness, because they had no predators to keep them from overpopulating and destroying their own habitat. They can try and move, and continue to destroy more habitats in their never-ending need for consumption. Animals don’t know how to plant new crops so they would only ever consume, never produce. Humans could try and burn resources to keep them fed, but the more they feed the more their population grows, and eventually even we run out of resources, and now we starve, too.\nUnless we kill them. Ourselves. And preferably make them into food, so that the resources they consumed haven’t gone to waste.\nThere are smaller examples of this in real life. Deer populations that grow too large and require hunters to come in and kill them because we’ve already hunted their predators to low numbers, if not extinction. But worldwide veganism would cause this to happen on a—you guessed it—worldwide scale. And if we can’t kill the over-consuming herbivores, they will literally eat the planet bare. And then not only do the herbivores die slowly and painfully of starvation and disease, but so does just about every other animal, too, including humans. Vegan means we can’t eat animal products, or the animals.. and now there’s no more vegetation. We have nothing left to eat, so we die. If we assume we never wisen up and learn that we need to kill and eat these animals to survive—either that or re-institute real predators and leave them the hell alone—the human race will go extinct, and the world will basically have to start over from what few species remain. If they can’t manage it, Earth becomes a dead planet. Lifeless. Barren.\nPlease, keep our planet healthy. Support humane slaughterhouses that treat their animals decently while alive, and kill their livestock as painlessly as possible, without tainting the meat. Be the omnivore humans are meant to be.\n2.5K viewsView upvotes",
            "isRelated": false,
            "isRequested": false,
            "views": "2.5K",
            "upvotes": "18 Upvotes"
        }
    ],
    "Is it right for humans to kill other animals for taste?": [
        {
            "author": "Why did humans decide killing animals to eat was ethical? — Related",
            "author_bio": "Antony Pateman",
            "text": "Interested in the natural worldAuthor has 946 answers and 2.9M answer viewsUpdated 2y\nHumans didn’t “decide killing animals to eat was ethical”.\nHuman beings developed partly due to our evolutionary ancestors eating of meat. We are not magical creations. We are animals grown from the bones of the Earth. We’ve been eating meat since long before we developed the mental capacity to decide that eating meat is unethical. It’s quite possible that had our ancestors never eaten meat then we would not today have the intellect with which to consider such matters.\nAs an afterthought, it should be noted that even cows (by way of insects in the grass) eat meat though they do not consciously c\nContinue Reading\n26\nLee Wilkinson\nDisaster Recovery Team Estimator (2017–present)Author has 555 answers and 1.4M answer views2y\nEthics come waaaaaaaaaaaaaaaaay after not dying. You have to be alive before ethics are even a thought.\nWe killed animals to eat or to protect ourselves from them as a way of surviving. Its only now, in a stable society, where food is plentiful that we have the luxury of deciding if eating a cow is enethical. Yes, I use the word “luxury\" intentionally. If you disagree, try this experiment. Take only a sleeping bag and a good knife into the woods. Live there for 90 days on only what mother nature provides. Heck, even take some seeds and grow some fruits, cereals or vegetables. If you wish, cheat by being near a well stocked garden and orchards! You will still have a protein deficiency when your stint is over.\nThere are people who live their entire lives without eating meat ( im given to understand that this is prevalent on the Indian Subcontinent)….some cheat and still eat fish or poultry. Others use soy or quinoa for protein, but they must take special care to get proteins, to stave off these deficiencies. Meat eaters get more protein more easily.\n241 viewsView upvotes\n1 of 21 answers\n10\n4\nLarry Seiler\nPhD in Computer Science, Massachusetts Institute of Technology (Graduated 1985)Author has 1.8K answers and 1.9M answer views2y\nHumans have, until very recent times, ALWAYS killed and eaten animals to survive. It is only in modern times that there was much of a practical alternative. So no decision in favor of killing animals was ever made — with few exceptions, it’s how it has always been.\nOf course the issue has been debated for centuries if not millennia. I’ve read many accounts of how so-called “primitive” peoples (really just meaning lacking modern technology) thought of their relationship to the (rest of the) animal kingdom. Their ethical systems, from what I have read, involve killing only to eat and in some case\nContinue Reading\n8\n2",
            "isRelated": false,
            "isRequested": false,
            "views": "241",
            "upvotes": "10 Upvotes"
        },
        {
            "author": "Should humans really kill and eat other animals when we have the option to not do it? — Related",
            "author_bio": "Nick Picard",
            "text": "B.A. from University of Victoria (BC, Canada) (Graduated 2013)Author has 2.2K answers and 3.5M answer views2y\nWe don’t have the option to not kill animals. Every human on earth indirectly kills animals by eating vegetables, using roads, using electricity, burning fuel, and everything else they do. Animals were killed in the production of all those things.\nSince I’m killing animals no matter what, I choose to eat a small number of them. Not too much and not too often is my goal. It makes me happier and healthier.\n3\n3\nMarylyn Senechalle\nAuthor has 17.9K answers and 5M answer views2y\nThere may be some health issues besides the animal’s for some people but I am still healthy and have been vegetarian for almost fifty years. My daughter, first husband, and I made the decision to go vegetarian. This was not an issue in my second marriage: he ate meat, daughter and I didn’t, and no one complained. This should be a personal decision, not a government decision.\n72 viewsView upvotes\n1 of 4 answers\nYour response is private\nWas this worth your time?\nThis helps us sort answers on the page.\nAbsolutely not\nDefinitely yes\n4\nEdwin Farrar\nM.S. in Physics & Engineering, University of Virginia (Graduated 1991)2y\nA lot of the planet’s land mass is not arable land. Animals are a proficient way to generate eatable food from that type of land. If a person tries to grow crops on land that really isn’t arable, you use a lot of water and energy that you wouldn’t need to otherwise.\nThere is also a management component of animal populations. Since there is not the animal predators as once were, humans need to fill that role so the health of the population as a whole does not decline which allows massive disease die-offs to occur.\nAlso as another person stated, this should be a personal choice and no person shoul\nContinue Reading\n4\n4",
            "isRelated": false,
            "isRequested": false,
            "views": "72",
            "upvotes": "4 Upvotes"
        }
    ],
    "Why is climate change bad?": [],
    "Why does Quora continuously allow insincere, degrading questions about President Trump to be posted?": [
        {
            "author": "How and why do questions get marked as insincere on Quora? — Related",
            "author_bio": "Kosta",
            "text": "Top Writer 2015, 2016, & 2017Upvoted by\nChristopher VanLang\n, Quora Admin Emeritus and\nPaul Stockley\n, Quora Admin EmeritusAuthor has 20.8K answers and 110.1M answer viewsUpdated 6y\nBecause they are not sincere.\nSo what many people confuse when they see a question marked as insincere is that Quora somehow knows whether you are sincere or not. There are many many insincere questions asked by people who are 100% sincere.\nWhat it means when a question is marked insincere is that the question is not there to collect answers and get knowledge. So if I ask “Why are so many cows murde\nContinue Reading\n318\n7\nSophia-Helene Mees de Tricht\nFortune TellerAuthor has 8.3K answers and 50.9M answer views6y\nVery simply, when you ask a question that posits an opinion and only ostensibly elicits an answer…\nThat’s called “insincere.” You can’t do that. Ask a question. If you think it’s weird that Donald Trump is awaiting trial for raping a 13 year old, ask “why is Donald Trump awaiting trial?” Not “why do democrats harp on the fact that Donald Trump is awaiting trial for rape? I mean, isn’t Bill Clinton a rapist?”\n1.4K viewsView upvotes\n1 of 38 answers\n49\n7\nAmy E. Brown\nWriting and editing here since 2016Author has 2.5K answers and 7.4M answer views3y\nI have not found the “official Quora definition”, but here’s how I define “insincere”:\nall number, letter, and word “puzzles”:\n“What is (any number pair separated by a mathematical function ) ?”\n“which number comes next (any alleged series)”? (Alleged because I can never spot those patterns. Reported because who cares!)\nAll word problems. Yes, all of them.\n“How many English verbs/fruits/sports teams begin with (any letter) and end with (any letter)?”\nSimilarly, all “unscramble this word” non-questions\n“How do you spell (any word)?“ Yes, spell\nContinue Reading\n27\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "1.4K",
            "upvotes": "49 Upvotes"
        },
        {
            "author": "What kind of questions on Quora aren't OK? What is Quora's policy on question deletion? — Related",
            "author_bio": "Faysel El Adduti",
            "text": "Has experienced lots of things.Author has 117 answers and 365.6K answer views5y\nAs someone who has asked lots of questions on Quora, I can give you some advice on what kind of questions are going to be deleted. Here are four questions, which I asked, that eventually got deleted:\nIs it possible that Xi Jinping can finally be assassinated after abolishing presidential term limits? If he gets assassinated, what do you think will be the consequences?\nAre you happy that Loy Machedo is finally banned from Quora?\nDoes it occur in the corporate world that a woman gets a raise by accepting sexual demands from a boss?\nIs that you on the profile pic? If you have trouble, then I'm open t\nContinue Reading\n27\n11\nDenny Redpath\nWorks at Libero Professionista (1993–present)Author has 1.9K answers and 3M answer viewsUpdated 3y\nI don't mind if Quora does whatever is in their rules and regulations and deletes what posts they consider bad. I am a foreigner and I love answering questions but if I have to think about an answer for thirty minutes, it will stop my flow and enthusiasm.\nIn some countries “gypsy” is “gypsy” not a Rom. I wouldn't have known that it offends some as I've never had that discussion in my life.\nI noticed somewhere that seventy to ninety of my answers were still drafts. Does that mean they are not all right? Where do I see them?\nI will answer questions as long as it's easy and fun. If it stops being fun and becomes a problem, it's of your creation. You do what you want. I will stop.\nWhat's more important… questions or answers?\n3K viewsView upvotesView 1 share\n1 of 25 answers\n10\n1\n5\nDenis Havlik\nbeen on Quora for a while, posted a lot.Upvoted by\nChristopher VanLang\n, Quora Admin EmeritusAuthor has 8.5K answers and 7.8M answer views7y\nAnswer by Quora is quite exhaustive. As for the special case of https://www.quora.com/profile/Mugtaba-Hussien/questions , I would say: “avoid posting the questions that clearly indicate what you believe to be true”.\nExamples:\nWhy does the American election look so fake in 2016? - does it to everyone or just to you?\nWhy did the white man become hated by so many people of the world today and what can he do to reverse that? - did it? Who is this white man? Who are these haters?\nWho will benefit from USA becoming a police state? - maybe you meant to write “would”, not “will”?\nWhy can't south Sudanese p\nContinue Reading\n22\n3\n4",
            "isRelated": false,
            "isRequested": false,
            "views": "3K",
            "upvotes": "10 Upvotes"
        }
    ],
    "What are some things that look difficult but are easy?": [
        {
            "author": "What seems easy but is really hard? — Related",
            "author_bio": "Erin Patton",
            "text": "GatekeeperUpvoted by\nGinger Eaves\n, Masters English Literature & Mathematics, University of Houston (1980) and\nBill Rawlins\n, MA Mathematics, East Carolina UniversityAuthor has 2.5K answers and 32M answer views1y\n66.6K viewsView upvotesView 40 sharesAnswer requested by\nAhasanul Mustari Sristi\n1 of 787 answers\n10.6K\n40\n77\nNitin Singh\nAuthor has 77 answers and 5.9M answer viewsUpdated 2y\nThis man needs no introduction.\nContinue Reading\n14K\n96\n297\nAbhishek Tr\nI binge watch movies. Upvoted by\nAnugya Sahu (अनुज्ञा साहू)\n, MSc Mathematics, Indian Institute of Technology, Delhi (2021) and\nBhuvana Anilkumar\n, M.Sc. Applied Mathematics & Mathematics, Russian Peoples’ Friendship University (1996)Author has 420 answers and 27.8M answer viewsUpdated 5y\nYou're attending the marriage of your best friend. You're his best man. You're walking around welcoming the guests and then something happens.\nSuddenly you feel a cool breeze hitting your face from nowhere, that beautiful romantic song starts making sense, and then, under the dim lamp near the tree, you spot a dazzling angel whose random glance at you made your heart stop for a second. All gorgeous and divine, she's out there smiling in that red saree. You're in a trance.\nYou shamelessly go to your best friend and ask him about her. She's the best friend of your best friend's to-be spouse. Bingo\nContinue Reading\n8.7K\n1\n118",
            "isRelated": false,
            "isRequested": true,
            "views": "66.6K",
            "upvotes": "10,656 Upvotes"
        }
    ],
    "Would you move to Wilmington, NC if you were a liberal, vegan, pro black lives matter, and concerned about climate change?": [],
    "How are your views on vegetarian or vegan diets changing with warnings of climate change becoming more dire?": [
        {
            "author": "Cailean MacConnich",
            "author_bio": "Over 40 years as Vegetarian/Vegan.Author has 1.1K answers and 1.1M answer views5y",
            "text": "Related\nWhy do vegetarians refuse to become vegan?\nI've been a vegetarian for over 30 years, but I'm not what I would define as a vegan.\nI don't eat meat.\nI don't buy leather products but do have an old pair of leather shoes.\nI don't wear wool\nI do take prescribed antibiotics.\nVegan is black and white.\nYou either follow the belief 100% or you are not vegan.\nI am as.close to vegan as I can reasonably get.\nI do what I can within my own limitations to minimise the suffering of other sentient beings.\nPlease read: www.plantbasedman.blogspot.co.UK\nI've explained the whole vegetarian/vegan thing in more detail.\n93.5K viewsView upvotesView 1 share\n1 of 51 answers\nYour response is private\nWas this worth your time?\nThis helps us sort answers on the page.\nAbsolutely not\nDefinitely yes\n115\n1\n29",
            "isRelated": false,
            "isRequested": false,
            "views": "93.5K",
            "upvotes": "115 Upvotes"
        },
        {
            "author": "Nonya Waines",
            "author_bio": "Animals are friends, not food. Vegetarian for 20+ years.Author has 2.3K answers and 5.5M answer views4y",
            "text": "Related\nAre vegetarians/vegan aware that a diet with some meat is more environmentally friendly? Does that change your mind at all on being a vegetarian?\nIt isn’t. So it wouldn’t.\n38 viewsView upvotesAnswer requested by\nDaniel Smith\n1 of 13 answers\n5",
            "isRelated": false,
            "isRequested": true,
            "views": "38",
            "upvotes": ""
        }
    ],
    "Can becoming a vegan save the planet from permanent damage done from climate change?": [],
    "Why should I change my lifestyle to live more ethically and lessen my environmental impact? Is climate change too big an enemy to fight just by going vegan? It seems like humanity's number is up. So what’s the point?": [
        {
            "author": "Should people change their lifestyles in response to global warming? — Related",
            "author_bio": "Eric Last",
            "text": "music fanatic, skeptic, gimp, political junkieAuthor has 6.6K answers and 3.9M answer views8y\nYes. People should, at the very least, try to drive fuel efficient vehicles, avoid wasting energy (i.e. turn off lights, etc.), carpool or use public transportation where practical, and reducing consumption of meat would help, too. And people should vote for leaders who are willing to support steps that will move us in the direction of using more renewable, sustainable, clean energy sources.\n4\n1\nPeter Malone\nFormer science teacher Author has 3.3K answers and 497.5K answer views9mo\nAbsolutely. The single, most effective, most immediate step anyone can personally take to fight climate change is to eat lower on the food chain eating primarily a plant based diet\n10 viewsView upvotes\n1 of 13 answers\n1\nHein Oomen\nPassionate about the global energy transition 8y\nAgree with Eric's answer although I would reverse the order: First of all vote (with your ballet but also your wallet) for leaders that are willing to make the substantial yet necessary changes to our society, because if we only rely on what people are voluntarily willing to change in their behavior, we will never get even close to doing enough to stay within acceptable limits of global warming.\n2",
            "isRelated": false,
            "isRequested": false,
            "views": "10",
            "upvotes": "1 Upvote"
        },
        {
            "author": "What lifestyle changes have you made in response to climate change and other environmental issues? — Related",
            "author_bio": "Andrew McLeish",
            "text": "BSc (hons) in Environmental Science, The Open University (Graduated 2015)Author has 6.4K answers and 4.3M answer viewsUpdated 2y\nVery few of any individual substance but they do add up.\nI source my electricity from a “renewable only” supplier\nmake sure I am recycling as much waste as possible and reduce packaging whenever I can\nread labels a bit more carefully for the food mileage\nplan meals more carefully to avoid food waste\nreduce my intake of animal protein\nreuse everything I can for as long as I can (e.g. I have a few plastic carrier bags that are over 10 years old now; I have slight pronation (my shoe wears more on one side than the other) so I have inserts I put in my shoes when they wear down to get the most out of the\nContinue Reading\n4\nL.A.M.\nI've been an amateur climatologist since 2017.Author has 2.9K answers and 1.6M answer views2y\nI’m reusing or planning to reuse some of my own plastic containers because…\nthe trade war with China has vastly reduced demand for recycled plastic, and I’d refuse to support the Chinese Communist Party extra even if they were buying.\nthey could come in handy for my plant nursery, which may help a small amount in warding off global warming (by increasing canopy cover) and is absolutely capable of saving the semi-sclerophyllous laurisilva (by moving it to higher ground).\nit’s best to find domestic uses for your own country’s recyclables. That way, your country can be economically self-sufficient and eco-friendly without relying on exports. This is an especially big deal here in the USA due to our former dependence on China (see above) and high carbon footprint.\n116 viewsView upvotesAnswer requested by\nJohn Collins\n1 of 12 answers\n2\nRon Wiseman\nCorporate executive in US manufacturingAuthor has 9.8K answers and 37M answer views2y\nWe significantly improved our lives in response to climate change and other environmental issues.\nMy wife and I now both drive Toyota Priuses. I bought both of our cars used with 150,000 miles on them, paid cash, and have no car debt. Insurance is very low. They get almost 50 miles to the gallon.\nWe eat farm to table, cutting out industrial farming. The food is more than twice as good.\nWe got rid of tons of stuff we didn’t really need and downsized our home to a bungalow close to the beach. Our living costs have dropped dramatically and we love the smaller house. It’s so easy to keep it clean.\nWe\nContinue Reading\n2",
            "isRelated": false,
            "isRequested": true,
            "views": "116",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "To what degree are you willing to change your lifestyle to address anthropogenic climate change? — Related",
            "author_bio": "Michael Barnard",
            "text": "Author has 13.4K answers and 57.7M answer views4y\nI’m not sure I’ve changed my lifestyle to address global warming as much as changed my life massively for the better and healthier in ways which oddly reduce my carbon footprint massively.\nI don’t own a car. I live downtown in an amazing neighborhood with tremendous amenities I can walk to. I take the subway to the airport when I travel because I chose to live near a subway stop and it’s insanely cheaper and more convenient than driving, parking, blah blah.\nI have car share, bike share and transit passes in the cities I regularly visit for work. I have Uber for when I can’t do one of the above,\nContinue Reading\n10\nJoanne C Wittstock\nAuthor has 8.1K answers and 8.3M answer views4y\nTo date, we have managed to reduce our heating carbon output about 27% by turning down the household temperatures and installing storm widows and heat capture films. Got about a 75% reduction in my transportation fuel use by stopping the use of my V8 SUV for casual running around. I now use a diesel Jetta for this and the SUV only when it's power is needed.\nI live in a rural area where the risk of fire is increasing and the summers are becoming drier. Making my buildings and keeping my land fire smart is an ongoing almost lifestyle project as is conserving water. My goal is to avoid extreme involuntary lifestyle changes.\n86 viewsView upvotesAnswer requested by\nBrandon Wilhelmsen\n1 of 6 answers\n2\nScott Bernard\nBSEE from University of South FloridaAuthor has 487 answers and 326.2K answer views4y\nI’ll give up my private jet, yacht and mansion when Al Gore and Leonardo DiCaprio give up theirs.\n2",
            "isRelated": false,
            "isRequested": true,
            "views": "86",
            "upvotes": "2 Upvotes"
        }
    ],
    "Why has activism, such as climate change, veganism, feminism, LGBT and a host of other causes become such a regular, and aggressive part of our modern society?": [],
    "Do you believe that eating meat is bad for the environment? Should we all go vegan to reverse climate change?": [],
    "Is the most immediately effective method for battling climate change a mass conversion to veganism?": [],
    "As a solution for climate change, is it better to eat a vegan diet which includes imported food, often flown in by airplane and requiring a lot of fossil fuels, or a local diet that includes non-vegan food?": [],
    "With veganism, feminism, religion, political correctness and climate change, what else causes such extreme views and divides us?": [],
    "I don’t like vegan food and I want to avoid eating animal products to help fight climate change. What are my options left?": [],
    "Why should we not support veganism as a solution to climate change?": [
        {
            "author": "Why do climate alarmists never give solutions for climate change? — Related",
            "author_bio": "Jim Griepenburg",
            "text": "Studied Physical Organic Chemistry at University of Rochester (Graduated 1971)Author has 6.1K answers and 4.4M answer views3y\nI am downvoting this question because of the use of charged language and an implied falsehood. Scientists and politicians who have studied the effects of industrial processes, the use of excess fossil fuels etc. have stated what is needed to curtail the effects. Briefly: Reduce with the intent to almost eliminate the burning of fossil fuels and use renewable energy. Reduce our energy usage. Conserve and reuse our natural resources. Promote biodiversity and stop the extinction of other species. Control population growth.\n7\n1\nLuke Anderson\nFormer CEOAuthor has 5.6K answers and 1.4M answer views3y\nNever give solutions?? There are MANY \"solutions\" and when groups like Extinction Rebellion march they are demanding that those solutions be implemented.\n66 viewsView upvotes\n1 of 17 answers\n4\nJohn Elm\nStudied Physics at University of Guadalajara (Graduated 2020)Author has 399 answers and 655.3K answer views3y\nBecause “climate alarmists” are a totem built by the denizens of feeliesburg, USA, a caricature made to deflect the fact they are ignoring the real world down beneath their very feet. A sweet lie to conform to norm and self complacency and ignore progress and improvement.\nIn reality “climate alarmists” do not exist, so it’s impossible for them to mention anything that might poke a hole in the deniers’ arguments.\nYou see, for decades, a number of climate skeptics kept poking holes at climate change theories, and climate scientists kept finding new evidence that patched up these holes, or made it\nContinue Reading\n13",
            "isRelated": false,
            "isRequested": false,
            "views": "66",
            "upvotes": "4 Upvotes"
        },
        {
            "author": "Why do people tend to dislike the idea of a vegan future as we will have to some point to prevent climate change? — Related",
            "author_bio": "Rosalind Dalefield",
            "text": "Double Board-certified toxicologistAuthor has 12.6K answers and 20M answer views2y\nThere is no evidence that the human race will have to go vegan to head off climate change. Eat less meat, very possibly. Use primarily lab-grown meat and dairy, very possibly. But completely abandon eating meat, fish, and dairy? No.\n3\nWayne Bogda\nFormer Analyst, Contractor, teacher, servant.Author has 2.6K answers and 2.4M answer views2y\nWhy? Animals don’t fit into your future? What does eating them have to do with climate change? Methane? 😂\nAfter we kill all the cattle, and plant vegetables in their place (where vegetables won’t grow incidentally) you think everyone eating the same tonnage of vegetables won’t produce the same methane as the cattle? They’ll produce more actually. You see a cow has four stomachs, and is very good at processing grains and vegetables. Much better than humans.\n128 viewsView upvotesView 1 share\n1 of 20 answers\n7\n1\n1\nBarret Joseph Bird\nMassage Therapist at Self-Employment (2004–present)Author has 15.2K answers and 19.7M answer views2y\nHuman beings evolved to eat a combination of plant and animal nutrients. Regardless of philosophy or politics, a vegan diet involves a sacrifice, and an adjustment that is outside of the natural state of our species.\nWhat some people object to, me included, is the failure to acknowledge the above, by many vegan activists, as well as their wilful obliviousness to the fact that a vegan diet is a luxury afforded the wealthy. The vast majority of human beings do not have the luxury of choice when it comes to diet.\nMany of us object to the virtue signalling, the judgementality, the preaching, and the\nContinue Reading\n5",
            "isRelated": false,
            "isRequested": false,
            "views": "128",
            "upvotes": "7 Upvotes"
        },
        {
            "author": "Can vegetarianism help to stop the global warming? — Related",
            "author_bio": "Smitaj",
            "text": "cyclist, farmer, teacher, a lifetime of study, 50 yr marriedAuthor has 16K answers and 5.1M answer views9mo\nNo. The current bandwagoning is incorrect. Methane has always been produced as a by product of breakdown of organic matter.\nIt is a high energy material that is transient and breaks down to carbon dioxide and water though the action of bacteria, sunlight and other triggers.\nIt cannot persist in the atmosphere. It typically is gone in ten years. As we have drained swamps and destroyed natural herds of creatures we are adding less methane not more.\nAs a result methane levels fluctuate but they can only increase if there is an INCREASE in the RATE of production. They decrease if there is a decrease\nContinue Reading\n4\nScott Strough\nResearcher in carbon farming as a climate change mitigation strategyAuthor has 2.5K answers and 5.5M answer views6y\nVegetarianism alone does help very slightly slow AGW when the primary agricultural methods are unsustainable industrialized methods, yes. But to stop AGW requires both a reduction of fossil fuel emissions combined with a change to sustainable agriculture.\nSustainable agriculture does need animal impact. However, it becomes a personal choice as to whether we actually eat the animals, or just harvest eggs, milk and wool. Either way can work.\nWhat won’t work is completely eliminating all animal husbandry from agriculture. That locks us into unsustainable ag. Not as unsustainable as industrialised ag with animals, but still unsustainable.\nFor a more detailed answer as to why look here: Scott Strough's answer to What agriculture system will in the end sustain most people: with/without livestock & how much more/less efficient would it be?\n231 viewsView upvotes\n1 of 26 answers\n4\nLee Thé\nAuthor has 10.9K answers and 87.9M answer views4y\nIt would help a little bit, but in practical terms it would be a lot more effective to try to persuade people make meat a side dish or a small component of the main dish, and to eat more fowl and fish and invertebrates and less mammal meat—especially beef.\nThat is, the perfect is the enemy of the good. You’re far, far, far more likely to persuade people in large numbers to do what I’m recommending.\nFor example, here’s a popular Thai dish: pad thai made with chicken:\nContinue Reading\n16\n5",
            "isRelated": false,
            "isRequested": false,
            "views": "231",
            "upvotes": "4 Upvotes"
        }
    ],
    "How does animal agriculture affect climate change and how could veganism help?": [],
    "How exactly is becoming vegan, paying extra taxes, and driving Teslas going to save climate change while the majority like China does nothing?": [
        {
            "author": "Claire Jordan",
            "author_bio": "Worked at National Health Service (NHS)Author has 51.7K answers and 419.3M answer views3y",
            "text": "Related\nWhy do you think choosing vegan meat could help fight climate change?\nIt probably will in the US and other countries which use the wasteful and inhumane practice of keeping livestock confined in pens and then feeding them expensively-produced grain. In countries where livestock graze in the fields on land not suited to arable use, however, having to grow more arable crops instead of meat will require either more intensive and forced cultivation or more imports.\n876 viewsView upvotesView 1 share\n1 of 6 answers\n13\n1\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "876",
            "upvotes": "13 Upvotes"
        }
    ],
    "What are the alternatives of milk for a toddler considering we are a vegan family who would like to provide a vegan alternative of milk to our toddler too for health and climate change reasons?": [
        {
            "author": "Shannon Augustine",
            "author_bio": "I have an 9-year-old son.Author has 156 answers and 46.6K answer viewsMar 11",
            "text": "Any of the plant based milks! There’s almond, flax, coconut, cashew, soy, even macadamia nut milk. I’d personally recommend soy because it’s higher in protein and might be an easier source for a toddler to consume as other plant-based proteins like beans and mushrooms might take getting used to. Coconut would provide a healthy source of fat for children as well. My son’s personal favorite is almond, but he gets sources of fat and protein from other food sources so I don’t mind.\n43 viewsView upvotes\n2\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "43",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Emma Meddings Bates",
            "author_bio": "Childcare ProfessionalMar 12",
            "text": "How about you stop forcing YOUR dietary choices on your newborn baby and make THEIR dietary NEEDS your priority instead? A baby does not need to be vegan. Quite the opposite in fact. Why not give them what they need and ASK THEM when they are older if they want to be vegan. You made a choice - let them make their…\nOh - and before you ask it, your bloody cat or dog doesn’t need or want to be a vegan either…\n49 viewsView upvotes\n2\n3",
            "isRelated": false,
            "isRequested": false,
            "views": "49",
            "upvotes": "2 Upvotes"
        }
    ],
    "Does individuals making a choice to become vegan and drive electric cars, etc. make any difference in the grand scheme of climate change? Or are we too far gone for that?": [
        {
            "author": "Paul Gracey",
            "author_bio": "Former 35 Years in Aerospace at Hughes Aircraft Company (1964–1999)Author has 3.5K answers and 2.5M answer viewsUpdated 3y",
            "text": "Related\nAre electric cars climate-neutral?\nBeing a human isn’t carbon neutral. We eat and breathe, consuming oxygen and exhaling a mixture containing more CO2 than we took in because of the energy we extracted from the plant material that produced the food, either directly or second hand from the meat animals we eat which in turn add to the CO2 and methane.\nBut it is all relative even with cars. All cars are built using carbon producing methods. Building EVs at present does use a bit more carbon output to produce, but that is changing as we roll out more and more electrified versions of all machines currently using IC engines.\nThe electric cars produced by those methods will last longer, need no oil changes for that longer lifespan and will not cost our children’s health due to asthma, that is one of the hidden costs of our current mix of vehicles in heavily populated areas. Once the car is built, it is climate neutral, and the more we replace the ones that are much worse, the sooner our climate temperature rise problems will be neutralized. We cannot afford to do less than that, and we should do more than that in many other areas. Meat consumption like I knew in the 1950s, when it was only once per day or less, would go a long way towards a more healthy world in both the human health consequences, and the carbon emissions.\nUsing pick-up trucks for their design functions instead of glorified personal transport would be a much needed improvement too. Even if electrified, they waste both space on the roads better used for goods transport and their energy consumption through air drag is wasteful unless used for necessity instead of impressing one’s neighbors or the intimidation of traffic ahead.\n214 viewsView upvotes\n1 of 33 answers\n8\n3",
            "isRelated": false,
            "isRequested": false,
            "views": "214",
            "upvotes": "8 Upvotes"
        }
    ],
    "Why do liberals think banning meat & dairy by 2050 is a smart move? They’re trying to phase out foods such as Big Macs from McDonald’s & more. I think climate change is hoax. This ain’t science. Vegan diets are not the healthiest diet, it’s worse.": [],
    "What are some small things that we can do to prevent climate change apart from going vegan and banning plastic grocery bags?": [],
    "Is veganism a righteous approach with regards to climate change and reducing your carbon footprint? Would this not eventually also lead to mass production in the future?": [
        {
            "author": "Jayne Kulikauskas",
            "author_bio": "eats meat drinks waterAuthor has 496 answers and 347.8K answer views4y",
            "text": "Related\nCan becoming a vegan save the planet from permanent damage done from climate change?\nNo. The opposite is true. There is a kind of agriculture called regenerative agriculture that can reverse damage to the environment. It involves raising livestock and people eating meat.\nCurrent conventional agriculture uses artificial fertilizer which is made from non-renewable resources and creates a huge amount of emissions. It destroys soil, air, and water. Regenerative agriculture, on the other hand, functions more like an natural ecosystem. Ruminants graze on grassland and their manure acts as a natural fertilizer which builds up soil quality and sequesters carbon. Grassland is healthier when animals are properly grazed on it which in turn improves air and water. People then eat the ruminants or use them as a source of milk.\nWe certainly do need to stop producing both animal and plant based food the way that we currently do. It is destructive and inefficient. But all the vegan factoids about how bad it is to eat meat are based on assuming that food will continue to be produced this way. Merely refraining from eating animal products while continuing to raise plants with conventional agriculture is not going to fix problems with the environment. All agriculture, both plant and animal, needs reform. And if we do this, then eating meat will not be harmful to the environment, but rather beneficial.\n593 viewsView upvotes\n1 of 2 answers\n10\n2",
            "isRelated": false,
            "isRequested": false,
            "views": "593",
            "upvotes": "10 Upvotes"
        }
    ],
    "Is there any evidence that vegans and vegetarians have had a noticable impact on climate change and environmental conservation, or has their effect been negligible so far?": [
        {
            "author": "Roger Solminski",
            "author_bio": "Former Electrician, High School Physics Teacher, RetiredAuthor has 1.8K answers and 246.8K answer views4y",
            "text": "Related\nDo vegans and vegetarians save our environment?\nNo, because it is completely possible to produce carbon negative meat. The problem isn't meat it's the terrible way we raise them with substandard feed and no concern for the environment. It can be done beneficially, it just isn't. Lastly growing grain and the annual vegetables we eat is ALSO causing significant environmental destruction, carbon emissions, and destroying valuable perennial grasslands which sequester more carbon per acre than a forest. Veganism isn't a fix it is nothing more than an ineffective band-aid that will keep civillization going a few more years rather than actually addressing the problem and fixing the inherent problems with our entire food production system. As it stands they are not part of the solution they are part of the problem because they are confusing and conflating the issue rather than identifying the underlying disease and treating it they are only treating the systems while the cancer that is our unsustainability grows.\n117 viewsView upvotes\n1 of 6 answers\n5",
            "isRelated": false,
            "isRequested": false,
            "views": "117",
            "upvotes": "5 Upvotes"
        }
    ],
    "Why is the United States going vegan by 2050? Climate change is a hoax. This is why I support Republicans over democrats. I don’t want a crappy raw sugarless alkaline vegan diet. I don’t want meat, dairy, and sugar to be eliminated by 2050.": [],
    "What is the best way to come up with vegan food startup ideas to create companies for the sake of our future generations considering the fact that the meat industry is the biggest reason for climate change today?": [],
    "Can individuals really make a difference to climate change? Doing things like turning vegan, using electric cars, etc. seems totally pointless when countries like China and America won't even admit there is a problem?": [
        {
            "author": "How is China responsible for climate change? — Related",
            "author_bio": "Jay R Worsham",
            "text": "Author, musician, broadcaster, and constant readerAuthor has 1.2K answers and 1.9M answer views7y\nChina burns a little more than 3 billion metric tons of coal every year, and that puts a lot of carbon dioxide into the atmosphere. That’s about 3 1/2 times as much as America.\nOf course, the population of China is about 4 times that of America, so both countries are burning about the same amount per capita.\nBut the atmosphere doesn’t care anything about per capita.\nThere are many other countries burning coal, and various other sources for air pollution. All are contributing to climate change. China isn’t excessive in its energy policies, it’s just more populated and therefore more of a source fo\nContinue Reading\n16\n11\nJamal Munshi\nStudied at University of ArkansasAuthor has 3.6K answers and 408.8K answer viewsUpdated 2y\nChina is using the climate insanity of the West to sell them all the wind turbines and solar panels they want and to sign mining deals in Africa where the raw materials for these products are found. The Chinese are savvy businessmen. And women.\n135 viewsView upvotes\n1 of 17 answers\n2\nHardip Singh\nFormer Defence Officer (Retired) at Government of IndiaAuthor has 1.8K answers and 357.2K answer views2y\nHuman lives hardly matter for Beijing. Even if they declare on oath about their commitment to protect environment, none can trust them. They would never compromise on their industrial production, as strong economy provides them sharp teeth for muscle flexing. Xi Jinping would like to win every war without firing even a single bullet.\nInstilling fear about repercussions from PLA, had been a very successful foreign policy gimmick of PRC during the last 7 decades. Provision for more funds for the strengthening PLA is feasible only if China doesn't worry much about climate change.\n5",
            "isRelated": false,
            "isRequested": false,
            "views": "135",
            "upvotes": "2 Upvotes"
        },
        {
            "author": "Do you think China cares at all about climate change? — Related",
            "author_bio": "Avun Jahei",
            "text": "Author has 9.2K answers and 1.6M answer viewsUpdated 3y\nThere are certainly very few climate science deniers in China:\nContinue Reading\n67\n2\n6\nNathan James\nGeopolitical pundit and blogger.Author has 8.4K answers and 33.8M answer views1y\nVery much so. In fact, China is doing more to fight pollution and climate change than any other country on earth!\n178 viewsView upvotesView 2 shares\n1 of 14 answers\n6\n2\n6\nUnderstanding China\nAuthor of “Understanding China” & China Observer (2010–present)Author has 245 answers and 1.2M answer views1y\nYes, very much\nChina is a developing country with a population of more than 1.3 billion and is one of the countries most seriously affected by climate change in the world. Global climate change has had a heavy impact on China’s economic and social development and people’s life.\nContinue Reading\n2\n2",
            "isRelated": false,
            "isRequested": false,
            "views": "178",
            "upvotes": "6 Upvotes"
        }
    ],
    "Why are domestic cats smarter and better than cows? Cows are worthless and liberals are banning meat and dairy. Cats aren’t made to be eaten. Cows are made to be eaten. Scientists, liberals, and vegans know nothing. Climate change is also a hoax.": [
        {
            "author": "Maureen Murtha",
            "author_bio": "Studied at University of Florida8y",
            "text": "Related\nHow were cows domesticated?\nWe don't actually know, for sure. What we do know is that the common ancestor of domestic cattle, the great auroch, was much larger (weighing around 2,000 lbs on average) and hunted, to extinction, by humans for many many many years. Likely, some auroch calves were raised by humans, or mild-tempered individuals were kept in close proximity and, ultimately bred. Hand-rearing and selecting for human-friendly temperament is the standard way that people have domesticated all of the animals that have \"co-evolved\" with us, so to speak.\n3.4K viewsView upvotes\n1 of 4 answers\nYour response is private\nWas this worth your time?\nThis helps us sort answers on the page.\nAbsolutely not\nDefinitely yes\n9\n1",
            "isRelated": false,
            "isRequested": false,
            "views": "3.4K",
            "upvotes": "9 Upvotes"
        }
    ]
}